{
  "appId": "1443374691",
  "reviewCount": 54,
  "reviews": [
    {
      "id": "11922972570",
      "userName": "ml4u",
      "userUrl": "https://itunes.apple.com/us/reviews/id22022551",
      "version": "106.63.3",
      "score": 1,
      "title": "O new content",
      "text": "Pay monthly subscription and contents are old.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2024-11-07T07:04:24-07:00"
    },
    {
      "id": "11895407194",
      "userName": "bryanb0621",
      "userUrl": "https://itunes.apple.com/us/reviews/id239576032",
      "version": "106.63.3",
      "score": 1,
      "title": "App no longer works",
      "text": "After the most recent update the app is completely broken. When you click on anything a small notification window pops up with “internal server error.” I reached out to support trying to see what was going on and they only seemed concerned about my subscription Then I was asked for my Apple ID and phone number which had absolutely nothing to do with the problem, and would not address anything about the app error. Without a subscription the error still pops up. DO NOT SUBSCRIBE. I had to request my money back from App Store support.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2024-10-31T04:23:26-07:00"
    },
    {
      "id": "11737629270",
      "userName": "jens12344",
      "userUrl": "https://itunes.apple.com/us/reviews/id418187419",
      "version": "106.63.3",
      "score": 1,
      "title": "Frustrating",
      "text": "The content is good - even though nothing new has been added in at least two years. Unfortunately the app is broken at least one week per month and the customer service is non-existent.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2024-09-18T07:20:01-07:00"
    },
    {
      "id": "11169831753",
      "userName": "KingGoffery",
      "userUrl": "https://itunes.apple.com/us/reviews/id217799884",
      "version": "106.63.3",
      "score": 1,
      "title": "No New Workouts",
      "text": "I’ve subscribed to Title Boxing on Demand since December 2023. In 5 months, I have not seen any new workouts uploaded to the app. Even the “workouts of the week” have not changed and zero results are found when using the filter “what’s new”. I tried reaching out to customer service and they said that 1 new workout is uploaded each week but I have seen no evidence of this.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2024-04-17T09:10:07-07:00"
    },
    {
      "id": "11000333730",
      "userName": "Shaevins",
      "userUrl": "https://itunes.apple.com/us/reviews/id12853105",
      "version": "106.63.3",
      "score": 1,
      "title": "Internal Server Error",
      "text": "Writing a review to get attention from customer service. Please advise how I am supposed to access any of the workouts after continuously getting an error.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2024-03-02T07:56:35-07:00"
    },
    {
      "id": "10981668122",
      "userName": "Feeldaburno",
      "userUrl": "https://itunes.apple.com/us/reviews/id1210997721",
      "version": "106.63.3",
      "score": 4,
      "title": "Needs more bag only",
      "text": "I only like Bagwork. It would be nice to have more 30 and 45 min sessions.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2024-02-26T05:04:05-07:00"
    },
    {
      "id": "10797408640",
      "userName": "Travel a bit",
      "userUrl": "https://itunes.apple.com/us/reviews/id532976088",
      "version": "106.63.3",
      "score": 1,
      "title": "Not worth it!",
      "text": "It freezes up during a workout and then it just cancels the workout and you are left with a screen that says “MyFitAp”  not sure why since I do not have such app.  Anyhow, not a great app.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2024-01-07T21:05:23-07:00"
    },
    {
      "id": "10684182527",
      "userName": "ArthurKirkland201",
      "userUrl": "https://itunes.apple.com/us/reviews/id845461866",
      "version": "106.63.3",
      "score": 1,
      "title": "What happened?",
      "text": "This used to be great, now horrendous!",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2023-12-11T19:12:00-07:00"
    },
    {
      "id": "10661835112",
      "userName": "TPS021",
      "userUrl": "https://itunes.apple.com/us/reviews/id86684022",
      "version": "106.63.3",
      "score": 1,
      "title": "Old Content, Flaky App, Nonexistent Service",
      "text": "The UI is awful. Good luck finding new workouts if Title is even creating any. I had an account tied to a credit card. Once the card expired, there was no where to update my card. I emailed customer service to close my account and never heard back. Now I just receive emails every month that my card is expired.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2023-12-05T18:19:39-07:00"
    },
    {
      "id": "10443661132",
      "userName": "BartekMar",
      "userUrl": "https://itunes.apple.com/us/reviews/id124201546",
      "version": "106.63.3",
      "score": 1,
      "title": "never works",
      "text": "videos almost never load",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2023-10-05T20:39:16-07:00"
    },
    {
      "id": "9840143790",
      "userName": "Lucas78vegas",
      "userUrl": "https://itunes.apple.com/us/reviews/id376053794",
      "version": "106.45",
      "score": 1,
      "title": "Glitch",
      "text": "The workouts won’t load. It’s pretty annoying",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2023-04-19T18:59:45-07:00"
    },
    {
      "id": "9782261031",
      "userName": "Wsqaured",
      "userUrl": "https://itunes.apple.com/us/reviews/id357109087",
      "version": "106.19.2",
      "score": 3,
      "title": "I miss the old structure",
      "text": "I liked the old app/structure better. I feel like they don’t update it with new workouts that often, so you’re basically just doing the same exact workouts over and over again",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2023-04-03T05:43:28-07:00"
    },
    {
      "id": "9677113680",
      "userName": "gm44444",
      "userUrl": "https://itunes.apple.com/us/reviews/id698967502",
      "version": "106.19.2",
      "score": 1,
      "title": "No Option to Cancel",
      "text": "Title on demand was great - until they took the web version away and forced members to use this app.\n\nRatings and comments for workouts went away, the ability to play a workout on a larger screen went away, and conveniently - the ability to cancel your membership went away.\n\nUnder the “Profile” section, there is only a “Sign Out” option - there is also no FAQ or contact information listed. Interesting.\n\nAfter logging into my Club Ready, Title Boxing Club, and My Performance IQ accounts and not seeing a cancellation option anywhere, I’m less inclined to believe this is bad design - and more manipulative business practices.\n\nEnjoy the app, and if you don’t - good luck getting out.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2023-03-03T22:50:45-07:00"
    },
    {
      "id": "9527571309",
      "userName": "prbroste",
      "userUrl": "https://itunes.apple.com/us/reviews/id20417869",
      "version": "106.19.2",
      "score": 1,
      "title": "Unreliable",
      "text": "This is the second time this app has removed my favorite work out without any warning or any reason.  There is usually only one intermediate work out, and it is the one I do without fail, and they keep removing them. I would like to point out that it is possible to update your app while keeping the same media that you have always had in tact so I don’t know what is going on here.  But it is very frustrating and I am probably going to quit this service next time it is up for renewal and find some thing on YouTube instead.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2023-01-20T04:52:18-07:00"
    },
    {
      "id": "9521238873",
      "userName": "csreed94",
      "userUrl": "https://itunes.apple.com/us/reviews/id265547130",
      "version": "106.19.2",
      "score": 2,
      "title": "The most dysfunctional app I have ever used",
      "text": "Where do I even start. When I can log in, which is a coin flip.I’ve been using the On Demand subscription. Sometimes i’ll try to turn on a video, only to find that I’m being prompted to buy a subscription I already purchased? Then it won’t let me watch a video. \n\nWhoever engineered the video playing feature has clearly never used a feature like that. The scrolling feature is so sensitive. The slightest swipe anywhere on the screen tells the app that I am trying to scroll. Over half the time if I go to pause the video, the app thinks I’ve scrolled back and starts over from the beginning. There should also be a feature to skip forward or backward at 15 or 30 second intervals, and scrolling should only be processed on the video time bar at the bottom.\n\nThe search function is really useful.\n\nThis app could really use a lot of improvements.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2023-01-18T08:32:27-07:00"
    },
    {
      "id": "9520600228",
      "userName": "Lisa S. 24",
      "userUrl": "https://itunes.apple.com/us/reviews/id1216331456",
      "version": "106.19.2",
      "score": 1,
      "title": "Unable to use account or get support",
      "text": "Their new platform does not appear to be ready to roll out. Purchased annual membership to on demand March 2022. This new app is wonky and reset password link does nothing to assist with troubleshooting log in. I’m not able to access workout videos through this app or their website any longer. There is also no phone # for support or chat box that they allude to. No answers to my email support either. Loved these On Demand workouts. This experience leaves me looking into other programs. That is if I can even get ahold of someone before my March auto renewal hijacks things.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2023-01-18T04:57:13-07:00"
    },
    {
      "id": "9489759800",
      "userName": "Bryan Layton",
      "userUrl": "https://itunes.apple.com/us/reviews/id429603662",
      "version": "106.8.2",
      "score": 1,
      "title": "The Overhaul is Overawful",
      "text": "Instead of the trainers being at their home gym to do workouts, we have them crammed in a tiny room in total silence.\n\nThe 3 trainers I enjoyed and used frequently are gone. Sarah, Brian, and Michael are gone. Sarah especially because her 15 minute workout was the perfect add on after my weight training. She was there when I subscribed for a year last September.\n\nI won’t be renewing.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2023-01-09T12:40:33-07:00"
    },
    {
      "id": "9471853042",
      "userName": "HR Executive",
      "userUrl": "https://itunes.apple.com/us/reviews/id40347697",
      "version": "106.8.2",
      "score": 1,
      "title": "Worst App I’ve Ever Seen",
      "text": "I’m a product management professional and I have to say that you guys are leaving A LOT of money on the table with horrible app. First off, who developed this? Did they even test it with users? It’s awful at the most basic things. It’s hard to log in, it’s hard to find the gym you want to schedule a class with. It’s just harder than it should be. I get it, each of these gyms is a franchise but you are hurting these franchises with this app. They would be WAY better off going with MindBody than this terrible terrible app. I ended up choosing not to workout at the gym I wanted to go to just because it’s so hard to use this thing! And I like their workouts!!",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2023-01-04T15:36:42-07:00"
    },
    {
      "id": "9444036118",
      "userName": "hthrweather",
      "userUrl": "https://itunes.apple.com/us/reviews/id108543645",
      "version": "106.8.2",
      "score": 1,
      "title": "Bring back old app structure",
      "text": "New app update makes workouts hard to find and many workouts have been removed! There are no more total body strength workouts posted and many of the boxing workouts are now gone including my list of favorites I’ve saved over the years. Please make app more user friendly and restore videos that were loaded in previous version of the app! Thank you!",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2022-12-28T06:23:37-07:00"
    },
    {
      "id": "9144129357",
      "userName": "Shellbell 29",
      "userUrl": "https://itunes.apple.com/us/reviews/id352771291",
      "version": "8.4.2",
      "score": 5,
      "title": "LOVE Title On Demand!!!",
      "text": "I started using this app back in January after I was having trouble making the schedule at my local Title Boxing Club. I love this app!!! I can choose my own schedule and the coaches are awesome!! They are so motivating, very good at explaining what they are doing and encourage you to keep pushing through the workouts. I love the variety of workouts to choose from…bag work, strength training, core, etc. My favorite is boxing and weights. I also love that they are always adding new varieties of workouts that are fun and challenging. I love that I can create playlists so at the beginning of the week I make a weekly folder with the workouts I want to do that week. Then I can always go back and see when I did the workouts. Thank you Title On Demand for making my workouts fun, effective and leaving me excited for the next!!",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2022-10-02T09:12:33-07:00"
    },
    {
      "id": "8498395266",
      "userName": "EGmaceflow",
      "userUrl": "https://itunes.apple.com/us/reviews/id40690979",
      "version": "8.4.0",
      "score": 4,
      "title": "Great concept. Great workout.",
      "text": "Workouts are great. \nThe app needs some tweaking. \nSome of the workouts don’t load immediately.\nWould also be nice if it kept track of progress and showed completed classes.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2022-03-26T10:03:24-07:00"
    },
    {
      "id": "8448625795",
      "userName": "disapointedtodd",
      "userUrl": "https://itunes.apple.com/us/reviews/id750734480",
      "version": "8.4.0",
      "score": 2,
      "title": "Missing favorites",
      "text": "Title used to be great but recently they took down a lot of my favorite workouts, to include a lot of the great strength training and 45 min boxing workouts. I’m going to cancel my subscription soon.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2022-03-12T12:21:10-07:00"
    },
    {
      "id": "7756787796",
      "userName": "Yeah305864685456",
      "userUrl": "https://itunes.apple.com/us/reviews/id216006206",
      "version": "8.2.0",
      "score": 3,
      "title": "Good workouts, mediocre app",
      "text": "The workouts are great and I’ve used the app for over a year now. My biggest complaint is that it freezes up a lot on both my phone and the website on my computer. I don’t have that issue on any other site or app (YouTube, twitch, Facebook, etc.) it is really frustrating when the app freezes mid-workout. \n\nAlso, I wish the filter for workouts was more efficient. 8 vs 4 rounds and 30 vs 45 minutes makes it hard to sort for similar workouts.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2021-08-31T16:22:53-07:00"
    },
    {
      "id": "7678661620",
      "userName": "Mmmbopp",
      "userUrl": "https://itunes.apple.com/us/reviews/id202767213",
      "version": "8.1.0",
      "score": 2,
      "title": "Awesome Workouts, Poorly Made App",
      "text": "The workouts are great. They offer a good mix of skill, cardio, and strength that are hard to find with other apps.\n\nThe app itself is a mess though. It loses connection easily, won’t load half the time, and misses a lot of features of rival apps like fight camp and the mirror where you can filter workouts, choose your own music, etc. \n\nIf I’m reviewing for workout quality, it’s a 5 as they are engaging and actually very good boxing workouts, but if reviewing as an app, it’s a 2 since it’s pretty busted most of the time. Please invest in it and actually make it a contender with other on demand fitness services!",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2021-08-10T18:02:57-07:00"
    },
    {
      "id": "7214265850",
      "userName": "quillsmama",
      "userUrl": "https://itunes.apple.com/us/reviews/id287263678",
      "version": "8.0.0",
      "score": 4,
      "title": "Needs watch compatibility",
      "text": "I love the workouts and everything but it needs to be compatible with the Apple Watch since you can’t really wear it under your gloves. Should sync like other fitness apps do",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2021-04-12T07:55:15-07:00"
    },
    {
      "id": "7154811765",
      "userName": "Cartogo2",
      "userUrl": "https://itunes.apple.com/us/reviews/id676705918",
      "version": "8.0.0",
      "score": 5,
      "title": "Amazing",
      "text": "I went from 150lbs to 125lbs during the pandemic all because of boxing in my garage. These videos offer a huge variety of training options to fit my needs. The high intensity calorie burn helps me stay fit and buff, versus no outcome when I to ran on a treadmill for endless hours.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2021-03-28T07:02:31-07:00"
    },
    {
      "id": "6989694642",
      "userName": "Arkteros",
      "userUrl": "https://itunes.apple.com/us/reviews/id1108656803",
      "version": "7.0.0",
      "score": 5,
      "title": "Great app",
      "text": "Really great app and good workouts. One area for improvement is that I use it for kickboxing and would LOVE to see more longer sessions with Ro. I’m not in great shape yet and the encouragement and alternative options he gives really keep me from giving up and laying on the ground. The monthly price at $20 is very reasonable for the selection.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2021-02-13T07:45:09-07:00"
    },
    {
      "id": "6937066333",
      "userName": "Saeli1987",
      "userUrl": "https://itunes.apple.com/us/reviews/id276225477",
      "version": "7.0.0",
      "score": 5,
      "title": "Great app",
      "text": "Great app for sure worth the price.. just wondering two things..\n\n1) will there be a way to track punches or wil we have to buy our own punch trackers\n\n2) is there new content every week?? Or what we have is what we will have??\n\nAnd will there be a 3 month or 6 month purchase for those who don’t want to do a year or discount??",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2021-01-31T09:12:01-07:00"
    },
    {
      "id": "6930374638",
      "userName": "Funny clowns",
      "userUrl": "https://itunes.apple.com/us/reviews/id162235270",
      "version": "7.0.0",
      "score": 5,
      "title": "Good but could be improved",
      "text": "Workouts are really good. The app could be enhanced to report heart rate and calories burned when using a tracking device.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2021-01-29T17:57:44-07:00"
    },
    {
      "id": "6807453453",
      "userName": "Luc7886",
      "userUrl": "https://itunes.apple.com/us/reviews/id107506876",
      "version": "6.0.7",
      "score": 2,
      "title": "Needs developer help",
      "text": "Search feature doesn’t work properly so you never find the correct videos you’re looking for (not all tagged correctly so selecting options eliminates correct videos), not enough videos to justify the cost, instructors who have worse form than I do, horrible stock music, boring combinations even in the videos labeled advance. Fine if you’re a true beginner, but not satisfying if you have any boxing experience. Exception is Bryan’s classes. Wish he had more.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-12-29T09:18:06-07:00"
    },
    {
      "id": "6671362706",
      "userName": "JJC 600",
      "userUrl": "https://itunes.apple.com/us/reviews/id18636457",
      "version": "6.0.6",
      "score": 1,
      "title": "Complete Joke",
      "text": "A very big miss.   You can get everything online for free.    Don’t waste your money.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-11-21T14:19:34-07:00"
    },
    {
      "id": "6472180513",
      "userName": "Gafazz",
      "userUrl": "https://itunes.apple.com/us/reviews/id988512550",
      "version": "6.0.3",
      "score": 5,
      "title": "Best workout ever!",
      "text": "These workouts keep my sane.  All the trainers are top notch.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-09-26T16:14:45-07:00"
    },
    {
      "id": "6398977260",
      "userName": "jGbbPg",
      "userUrl": "https://itunes.apple.com/us/reviews/id175514196",
      "version": "6.0.3",
      "score": 3,
      "title": "Wish I could use my own music",
      "text": "Workouts are good and I would LOVE this app if I could run my own music at the same time, otherwise not worth $25/month 😞",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-09-05T13:48:10-07:00"
    },
    {
      "id": "6352119481",
      "userName": "kelsmariad",
      "userUrl": "https://itunes.apple.com/us/reviews/id1111033703",
      "version": "6.0.3",
      "score": 4,
      "title": "Need more videos but love the app overall",
      "text": "I’ve been to a few different Title gyms from Kentucky to Chicago over the past several years and I have to say I am very app with the app. However, I’ve been using this app for a few months and I have already completed all of the boxing courses a few times. Would love to see more 45 to 60 min boxing as well as kickboxing! This app is certainly worth a shot! I have a boxing bag in my garage so having this while in quarantine has been a relief! :)",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-08-23T05:57:10-07:00"
    },
    {
      "id": "6340681681",
      "userName": "constructivecritizer",
      "userUrl": "https://itunes.apple.com/us/reviews/id111664077",
      "version": "6.0.3",
      "score": 5,
      "title": "Great workouts",
      "text": "Great workout and easy to use",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-08-20T02:59:50-07:00"
    },
    {
      "id": "6322689848",
      "userName": "JFoxx Inc",
      "userUrl": "https://itunes.apple.com/us/reviews/id108484250",
      "version": "6.0.3",
      "score": 5,
      "title": "Great Product!!",
      "text": "Love the energy from Taylor and Sarah👊🏾🥊",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-08-15T08:13:56-07:00"
    },
    {
      "id": "6148785302",
      "userName": "Mir24",
      "userUrl": "https://itunes.apple.com/us/reviews/id161644013",
      "version": "5.0.1",
      "score": 5,
      "title": "Amazing!",
      "text": "Listen, I don’t know why everyone is complaining. Vids are great quality. There are tons to choose from, from literally 3min to over an hour. Kickboxing, strength training, technique vids, and just straight up traditional title club boxing. Since COVID, my old title club remained closed for months (while still charging members full rate) for some seriously low quality zoom recordings and 30 min pre recorded workouts with terrible sound quality. This in comparison has been amazing. I use airplay to stream workouts from my iPad with no trouble at all. I haven’t run into any glitches or bugs. I’m thrilled. Thank you Title for bringing a viable boxing option into living rooms and basements!",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-07-02T08:10:27-07:00"
    },
    {
      "id": "6043897173",
      "userName": "hannah putna",
      "userUrl": "https://itunes.apple.com/us/reviews/id1149261776",
      "version": "5.0.1",
      "score": 1,
      "title": "horrible",
      "text": "literally will not let my delete my subscription.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-06-06T12:46:24-07:00"
    },
    {
      "id": "6035468385",
      "userName": "king0485",
      "userUrl": "https://itunes.apple.com/us/reviews/id370673870",
      "version": "5.0.1",
      "score": 3,
      "title": "WE NEED MORE CONTENT",
      "text": "WE NEED MORE CONTENT please. There is no reason there shouldn’t lots and lots of videos in all categories for all levels.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-06-04T12:56:16-07:00"
    },
    {
      "id": "5975895156",
      "userName": "burnerET",
      "userUrl": "https://itunes.apple.com/us/reviews/id37130662",
      "version": "5.0.1",
      "score": 2,
      "title": "Sub par app for the monthly cost",
      "text": "Apple TV app needs work. App is very disorganized as far as content. All just jumbled together. After every use, app constantly freezes and have to restart Appletv. For 24.99 a month, should be way better product",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-05-21T12:19:37-07:00"
    },
    {
      "id": "5888548545",
      "userName": "Soofster",
      "userUrl": "https://itunes.apple.com/us/reviews/id140801130",
      "version": "5.0.1",
      "score": 5,
      "title": "Awesome and worth buying a bag",
      "text": "Love it. Please upload more 45 min boxing workouts on bag!!!!!!",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-05-01T06:02:24-07:00"
    },
    {
      "id": "5717387096",
      "userName": "mole k a",
      "userUrl": "https://itunes.apple.com/us/reviews/id142204577",
      "version": "5.0.1",
      "score": 2,
      "title": "Format is solid, music is really bad",
      "text": "In each instructional video music will play in the background and it’s nauseating - no one wants to work out for 30 minutes with generic electronic noise on blast. Suggestions; integrate instructions with Spotify, select actual music to play during videos, or use captions so video can be viewed on mute. Current content is painful to sit through",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-03-26T11:33:58-07:00"
    },
    {
      "id": "5695640407",
      "userName": "pcdebb",
      "userUrl": "https://itunes.apple.com/us/reviews/id26330987",
      "version": "5.0.1",
      "score": 1,
      "title": "Won’t display properly",
      "text": "There is no way to contact support! I can’t get it to view properly on my iPad. Every contact I make says the server can’t be found. It’s time to cancel",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-03-22T02:02:10-07:00"
    },
    {
      "id": "5693258686",
      "userName": "Janellyf",
      "userUrl": "https://itunes.apple.com/us/reviews/id105398706",
      "version": "5.0.1",
      "score": 2,
      "title": "Fire stick cuts out",
      "text": "Literally every 5 minutes the app closes when using on the fire stick.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-03-21T12:43:17-07:00"
    },
    {
      "id": "5688599235",
      "userName": "akk711",
      "userUrl": "https://itunes.apple.com/us/reviews/id32301654",
      "version": "5.0.1",
      "score": 2,
      "title": "Offline content",
      "text": "The offline content doesn’t actually play offline. During this coronavirus quarantine the only place I can workout is in my basement but there is no service or WiFi signal down there. I was disappointed when the downloaded content wouldn’t play.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-03-20T13:46:28-07:00"
    },
    {
      "id": "5489124962",
      "userName": "RobinA74",
      "userUrl": "https://itunes.apple.com/us/reviews/id113214482",
      "version": "5.0.1",
      "score": 1,
      "title": "Cuts out with Amazon firestick",
      "text": "The video cuts out after 5-10 minutes every time I use it.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-02-04T18:40:30-07:00"
    },
    {
      "id": "5428212402",
      "userName": "The real yeyo",
      "userUrl": "https://itunes.apple.com/us/reviews/id182648765",
      "version": "5.0.1",
      "score": 4,
      "title": "Almost like going to the gym",
      "text": "Great idea! I was bummed out when I bought my house and found out there was no Title Boxing near me. I had to cancel my membership after going for 5 yrs. I’ve read the reviews and it seems like they’ve fixed most of the problems the app had. Now, there’s 2 reasons why I give it a 4 star rating. I have Beachbody on Demand and their music in their MANY programs is optional. I like having my own music. The music in these videos is always on though. Also there’s still a few kinks to make better to be able to compete with how organized Beachbody is. Their programs are really organized and have a cheaper on Demand platform. One of their programs is like Title Boxing, but it’s still not Title Boxing.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2020-01-20T11:11:06-07:00"
    },
    {
      "id": "4426125926",
      "userName": "Jillibean36",
      "userUrl": "https://itunes.apple.com/us/reviews/id30310165",
      "version": "4.1.11",
      "score": 4,
      "title": "Good but needs some improvements",
      "text": "I went to Title in San Diego for a little bit, but the monthly fees were more than I wanted to pay. $25/month with my own bag at home is more reasonable and let’s me mix it up with other workouts so I don’t get in a rut. The downsides - My app on Fire stick cuts out after 20 minutes every single time and I have to restart it, although luckily the video I’m watching picks back up at the same spot, and I wish there were more videos to choose from, although I notice they add a video about once per week, so that’s a start.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2019-07-07T11:18:48-07:00"
    },
    {
      "id": "4415786937",
      "userName": "haleybct",
      "userUrl": "https://itunes.apple.com/us/reviews/id34055074",
      "version": "4.1.11",
      "score": 4,
      "title": "Pretty Good Option If There’s Not A Title Near You",
      "text": "I used to live in Nashville, TN and was a long time member of a Title Boxing Club there. I got all the fundamentals down and was just obsessed with the workout. I moved to a small town and the closest TBC is probably 3 or so hours away. My gym has a punching bag so I tried to mimic the workouts but it was just never the same without a trainer shouting out the combos, etc. I recently downloaded this app and am so happy I did. For anyone who has the fundamentals down but doesn’t live near a TBC, I think this app is great! There are a lot of shadow boxing workouts but I just do the same combos on the heavy bag and it’s great. My only complains are that I wish there were more intermediate and advanced boxing workouts and I wish there were more 45 minute workouts or just 30 minute workouts with only boxing—no warm up or core. I find myself doing 2-3 of the 15 minute boxing workouts because I usually run or do my own warm up before I box and I wish they had more videos available with 8 rounds of boxing that I could just run straight through. I also wish more videos for boxing were updated more often. I feel like I repeat the same few every week. All in all, a pretty good option if you’ve got the fundamentals down but don’t live near a boxing gym.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2019-07-05T12:02:49-07:00"
    },
    {
      "id": "4082531534",
      "userName": "boxing katie",
      "userUrl": "https://itunes.apple.com/us/reviews/id110083281",
      "version": "4.1.11",
      "score": 3,
      "title": "Please add more workouts",
      "text": "I love title, but there aren’t enough workouts recorded to make it worth 25 a month.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2019-04-30T15:37:24-07:00"
    },
    {
      "id": "3948772441",
      "userName": "PilotZing",
      "userUrl": "https://itunes.apple.com/us/reviews/id21160313",
      "version": "4.1.11",
      "score": 1,
      "title": "No Power Hour",
      "text": "This would be worth it if there was a power hour option. Great for beginners but as a Title member for 5 years this is a huge miss.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2019-03-30T17:35:39-07:00"
    },
    {
      "id": "3810475187",
      "userName": "kinagor",
      "userUrl": "https://itunes.apple.com/us/reviews/id27668696",
      "version": "4.1.11",
      "score": 2,
      "title": "Not enough programming",
      "text": "I was a member at a Title Boxing Gym for a year and half, but have had trouble making the classes work for my schedule, so I was excited to see this On Demand app. However, there isn’t enough programming to be worth the subscription. As of right now, I only see ONE advanced boxing video, and it was only a 30 minute class. There needs to be more videos, including more advanced videos. I do have to say that the workout and trainer were good though. Would have subscribed if there was just more content.",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2019-02-24T11:41:05-07:00"
    },
    {
      "id": "3643423307",
      "userName": "hajabeh",
      "userUrl": "https://itunes.apple.com/us/reviews/id122862191",
      "version": "4.1.11",
      "score": 1,
      "title": "250$ not free",
      "text": "..",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2019-01-12T17:19:36-07:00"
    },
    {
      "id": "3581838997",
      "userName": "MJD.523",
      "userUrl": "https://itunes.apple.com/us/reviews/id35645810",
      "version": "4.1.11",
      "score": 3,
      "title": "Good for beginners",
      "text": "I used to go to Title Boxing Club for about a year and was hoping this would be a good replacement.  It’s good overall, but pretty basic. I wish it had some power hour workouts in more of the class setting.  Music could be improved a bit as well.  Not sure it’s worth the monthly subscription without some updates",
      "url": "https://itunes.apple.com/us/review?id=1443374691&type=Purple%20Software",
      "updated": "2018-12-27T17:55:41-07:00"
    }
  ]
}