{
  "appId": "992735679",
  "reviewCount": 313,
  "reviews": [
    {
      "id": "11644419183",
      "userName": "alyssa.n.s",
      "userUrl": "https://itunes.apple.com/us/reviews/id867410830",
      "version": "6.10.7",
      "score": 5,
      "title": "Inspection services",
      "text": "I used this company for my inspection that was required by Uber and was very happy with this service! They were fast, easy to use, and they were patient and kind when answering questions I had. It was really convenient as I could get it done at home and didn’t have to drive 30 minutes to a shop. I was able to get it done before work, with enough time to spare to get breakfast! I loved it, and appreciated the customer service.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2024-08-23T10:47:13-07:00"
    },
    {
      "id": "10885722627",
      "userName": "Bingyer",
      "userUrl": "https://itunes.apple.com/us/reviews/id123519745",
      "version": "6.10.7",
      "score": 1,
      "title": "They will never find your car",
      "text": "It can be perfectly pinned and they won't find your car. Then they will cancel while you are in a meeting and you will be gas-less. It happens every single time. It's a great idea in concept but the app execution has you dragging your pin to a picture!!!! It's never accurate enough for people",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2024-01-31T10:20:27-07:00"
    },
    {
      "id": "10878132420",
      "userName": "straightj23",
      "userUrl": "https://itunes.apple.com/us/reviews/id201078822",
      "version": "6.10.7",
      "score": 4,
      "title": "No service to apartment renters.",
      "text": "Sadly, I’m ineligible for this service since I live in an apartment complex. It’s a let-down, but that’s not Yoshi’s fault. Looking at the app, it looks like a fantastic idea. I hope y’all can find a way to expand soon.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2024-01-29T09:34:46-07:00"
    },
    {
      "id": "10692769429",
      "userName": "taylorsmomma",
      "userUrl": "https://itunes.apple.com/us/reviews/id546095870",
      "version": "6.10.7",
      "score": 5,
      "title": "Brilliant idea for a fuel delivery service",
      "text": "Absolutely love Yoshi\nEspecially on those days when life gets busy.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2023-12-14T01:23:48-07:00"
    },
    {
      "id": "10568820018",
      "userName": "Lukas94087",
      "userUrl": "https://itunes.apple.com/us/reviews/id1053828328",
      "version": "6.10.7",
      "score": 1,
      "title": "Watch out the subscription trap",
      "text": "Be aware, they do not send any notification via email or msg or something else for charging you the subscription fee. I used to use this app but did not reinstall it on my new phone, and until recently I noticed that I have been charged for monthly fees for almost 2 years without any notification until I noticed an unknown bill on my credit card statement. I talked to the customer service, and they only agreed to refund me for the most recent few months. It is ironic that they remembered to send me every ad and promotion email except for this most important one.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2023-11-09T18:14:21-07:00"
    },
    {
      "id": "10563883658",
      "userName": "DCRT_DedSec",
      "userUrl": "https://itunes.apple.com/us/reviews/id1235019382",
      "version": "6.10.7",
      "score": 1,
      "title": "Lack of customer service",
      "text": "Don’t recommend after the second time trying to schedule a gas-fill no where is it mentioned the rules do environmental safety standards.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2023-11-08T09:05:20-07:00"
    },
    {
      "id": "10559994554",
      "userName": "Water-burgers",
      "userUrl": "https://itunes.apple.com/us/reviews/id1248248015",
      "version": "6.10.7",
      "score": 3,
      "title": "Nice when it works",
      "text": "This is a great idea but they will cancel on you very regularly.  My last three orders have been cancelled due to “unforeseen circumstances.”  So it is nice when it works but don’t rely on it.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2023-11-07T06:59:49-07:00"
    },
    {
      "id": "10441541785",
      "userName": "Lilyes",
      "userUrl": "https://itunes.apple.com/us/reviews/id164378931",
      "version": "6.10.7",
      "score": 2,
      "title": "Great idea, bad app",
      "text": "Can’t edit vehicle information or even see what was entered. Picture of vehicle doesn’t match but you can’t tell if it’s because you entered it incorrectly or it’s some random picture.  The only way to make changes to vehicle is to delete and start over. Frustrating and annoying.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2023-10-05T06:53:02-07:00"
    },
    {
      "id": "10362187259",
      "userName": "Sarsaparilla1088",
      "userUrl": "https://itunes.apple.com/us/reviews/id25401385",
      "version": "6.10.7",
      "score": 3,
      "title": "Did the service leave Houston?",
      "text": "Did the service leave Houston area?!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2023-09-12T16:03:38-07:00"
    },
    {
      "id": "10292214345",
      "userName": "16deli",
      "userUrl": "https://itunes.apple.com/us/reviews/id575424399",
      "version": "6.10.7",
      "score": 1,
      "title": "NOT CHEAPER",
      "text": "They simply sell gas at same price as your location’s 2-mile radius.\nThere are more cheaper gas beyond that distance.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2023-08-23T17:07:42-07:00"
    },
    {
      "id": "10242960058",
      "userName": "Ed Gwin",
      "userUrl": "https://itunes.apple.com/us/reviews/id505687272",
      "version": "6.10.7",
      "score": 5,
      "title": "Awesome Detail",
      "text": "My employer gave me a car detail through this app and the staff was so helpful scheduling the service with me at the location of my choice.  The car looks amazing now!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2023-08-10T14:45:51-07:00"
    },
    {
      "id": "9984649829",
      "userName": "ESSPT",
      "userUrl": "https://itunes.apple.com/us/reviews/id6002328",
      "version": "6.10.5",
      "score": 5,
      "title": "I love Yoshi!",
      "text": "Getting gas delivered makes my life so much easier, and always having a full tank is better for my car. You can schedule everything through the app and they also offer other services such as washes and details. Revolutionary!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2023-05-31T08:58:31-07:00"
    },
    {
      "id": "9751190330",
      "userName": "DiamondKesawn",
      "userUrl": "https://itunes.apple.com/us/reviews/id365921016",
      "version": "6.10.5",
      "score": 5,
      "title": "Love it",
      "text": "Yoshi is a time saver and that in and of itself makes it AWESOME. Furthermore, the service drivers are always professional and the convenience of being able to have the service done at a time that works for me is a huge bonus.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2023-03-25T11:01:43-07:00"
    },
    {
      "id": "9572122829",
      "userName": "Fancybutterllc",
      "userUrl": "https://itunes.apple.com/us/reviews/id625543459",
      "version": "6.10.5",
      "score": 5,
      "title": "Amazing",
      "text": "Love there service love how they keep you updated through the process love not having to pump my own gas in the cold saves me time I really appreciate the effort also love the windshield cleaning and all the other services they provide one less thing to think about give me a peace of mind",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2023-02-01T10:37:40-07:00"
    },
    {
      "id": "9299655757",
      "userName": "natesucks",
      "userUrl": "https://itunes.apple.com/us/reviews/id1347033173",
      "version": "6.10.5",
      "score": 4,
      "title": "It’d be nice if they offer medium grade fuel. Not just regular and premium",
      "text": "It’d be nice if they offer medium grade fuel. Not just regular and premium",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2022-11-17T11:04:11-07:00"
    },
    {
      "id": "8582350561",
      "userName": "buchi998",
      "userUrl": "https://itunes.apple.com/us/reviews/id121940528",
      "version": "6.10",
      "score": 1,
      "title": "Scheduling nightmare",
      "text": "Multiple cancellations and back and forth to schedule on text. The point of the whole service to avoid this.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2022-04-18T18:07:47-07:00"
    },
    {
      "id": "8472733722",
      "userName": "UglyDuckling1980",
      "userUrl": "https://itunes.apple.com/us/reviews/id483947150",
      "version": "6.9.7",
      "score": 5,
      "title": "GMEmployee (full run down and extra rambles)",
      "text": "I really love Yoshi. \nI work at GM and they’re there regularly. It’s so convenient and with the price averaging, I usually end up getting my gas cheaper. \nYou can set up weekly visits. I get a fillip every Friday. If I need gas midweek, I just hit the buttons and when I come out of work on the scheduled day, my gas tank is full. I have severe asthma and standing in the Michigan winters, windy days, or humidity, makes my chest tight and I’m thankful. I no longer have to stand at a gas station at night (and worry because my city isn’t safe) because I planned on getting gas before work and then was running late. I’m a procrastinator and it’s so nice. \nThey average prices. So you get the best. \nThey do upgrade stuff. Fluids and other things like wipers. \nI was off work for a few weeks and I just hit the “skip fill up” button and it was easy peasy. Every time I’ve they text me the reminder that they’re filling my car up, and had I’ve had to text them back, they’ve always answered promptly and very kind. \nI honestly think, unless you enjoy going to the gas station for fountain drinks, this eliminates the gas station all together. \nThey send you a reminder \nThey fill up your gas \nThey text you a picture afterwards with the amount of gallons \nThen they send you an email receipt \n(that tells you all the local gas station prices within a certain mile radius). \nI’m going to schedule my daughters car too because she runs out of gas constantly and it’s super annoying. I think it’s great for anyone, but especially ppl who can’t stand to stand in extreme weather, disabled, elderly, or forgetful spoiled children. \nI’ve never had an upgrade so idk about that but the only thing I do is make sure my gas tank is unlocked and let the magical wizardry that is Yoshi do it’s thing. 👑",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2022-03-19T07:34:28-07:00"
    },
    {
      "id": "7932113867",
      "userName": "hhhwwweebd",
      "userUrl": "https://itunes.apple.com/us/reviews/id429677664",
      "version": "6.9.3",
      "score": 1,
      "title": "No service within 50 miles of me",
      "text": "Horrible app. It shouldn’t let you download unless it can actually deliver within your area. Plus why is there no Diesel option?",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-10-19T11:16:49-07:00"
    },
    {
      "id": "7923329155",
      "userName": "matthewmspace",
      "userUrl": "https://itunes.apple.com/us/reviews/id43743294",
      "version": "6.9.3",
      "score": 5,
      "title": "One of my most useful and favorite apps",
      "text": "Yoshi is a fantastic service. It’s so nice to not have to worry about having to touch a gas station pump or having to wait for a slot at somewhere like Costco.\n\nI currently get gas every 2 weeks or so, so it’s nice to have a set schedule. And they even come early in the morning between 4 and 9 if you want, so when they do my gas (and anything else) between 4 and 8, it’s all done before I have to head off to the office.\n\nThe customer service is very easy to reach too, just a text message away. If there’s an issue pumping your car or doing some other service, they’ll text you right away and give you a few minutes to fix the issue if needed.\n\nI’ve had issues with some of the sub-services like not pumping my tires full of air when I asked, but all in all, it largely works. And when they didn’t do the service, they refunded me that additional fee quickly.\n\nObviously if you don’t drive very much or have a very short commute, this app really isn’t for you. But if you like the convenience of not having to go to a gas station, this is a good app to get.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-10-16T22:01:54-07:00"
    },
    {
      "id": "7882762543",
      "userName": "kmyoshi",
      "userUrl": "https://itunes.apple.com/us/reviews/id277946882",
      "version": "6.9.2",
      "score": 5,
      "title": "Amazing service!",
      "text": "Love love love Yoshi! Super convenient, amazing customer support and top quality service. So grateful for Yoshi and that I never have to go to a gas station again!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-10-05T18:57:23-07:00"
    },
    {
      "id": "7882183098",
      "userName": "Yerffac",
      "userUrl": "https://itunes.apple.com/us/reviews/id600475505",
      "version": "6.9.2",
      "score": 5,
      "title": "Living like it’s year 2050",
      "text": "Such a fun experience and very revolutionary idea and app. I enjoy how simple the service is and how easy it is to communicate with customer service! Never pumping my own fuel again 🤩",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-10-05T14:35:49-07:00"
    },
    {
      "id": "7882163222",
      "userName": "Chapliza1610",
      "userUrl": "https://itunes.apple.com/us/reviews/id368646237",
      "version": "6.9.2",
      "score": 5,
      "title": "Convenient",
      "text": "I don’t think about getting gas at all since I set up a weekly delivery. It’s easy to cancel or reschedule too if I’m not at the office Rachel responds quickly to my texts",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-10-05T14:26:23-07:00"
    },
    {
      "id": "7879393316",
      "userName": "Caitydid86",
      "userUrl": "https://itunes.apple.com/us/reviews/id1239452122",
      "version": "6.9.2",
      "score": 5,
      "title": "Love!!!",
      "text": "I absolutely love the Yoshi service!! It’s so convenient!!  If I have an issue or need to change my schedule I can just send a quick text and I know a real person will see my message and her issue fixed or change my schedule.  I definitely recommend this app to my friends and family!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-10-04T21:07:52-07:00"
    },
    {
      "id": "7580023291",
      "userName": "izma13",
      "userUrl": "https://itunes.apple.com/us/reviews/id130058345",
      "version": "6.9",
      "score": 1,
      "title": "Not worth the extra $20 monthly fee",
      "text": "Not worth the extra $20 monthly fee \nOnly convince is getting gas delivered, but if you add gas fee with monthly fee you are actually paying more. \nI’ve had this app and used their service for almost about a year now, it’s started off good, I a fill up scheduled once a week and a car wash twice a month. Lately my service have not been consistent. I would have service scheduled with a time frame. After realizing the service have not been rendered, I reach out to them and ask, if they are running late and forgot to notify me? \nAll I get is sorry would you like to reschedule? \nI did, didn’t think much of it but was upset with the fact that I scheduled my service around my work schedule and lunch time. Now I received an email yesterday stating that effective Yesterday evening they will place a hold on my card for $60 and if there’s a fund it will take 2-3 days to get it back. \nOkay, but you’re informing the customer of this change not a month a head or even a week a head. Your information them that this became affective the day before they even receive the email or notice. Although not my case, but I understand some people don’t pay their bills or cards get cancelled or maxed I don’t know what the case is, but customers should at least get more time notice of such changes. \nWhat will change next? The monthly fee will go up for sure.  Don’t bother with this app or service.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-07-15T09:56:32-07:00"
    },
    {
      "id": "7426917566",
      "userName": "Rose455",
      "userUrl": "https://itunes.apple.com/us/reviews/id37732973",
      "version": "6.8",
      "score": 5,
      "title": "If you need gas this need this app",
      "text": "If getting incredibly discounted premium quality gas delivered directly to your vehicle wherever you are parked for at least 4 hours isn’t enough for you to use this app then it should definitely lay be the customer service. \n\nI must say I am wildly impressed with the direct and personalized service that is offered to the customers of Yoshi. My only small issues with it is that their operating hours can be a but tough with such large windows. But I am sure as they grow they will be able to offer more extended hours. And I do hope they grow to have all the success!\n\nPs I haven’t tried their add-on car wash services yet, but my neighbor uses it too and they are thrilled.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-06-04T14:09:14-07:00"
    },
    {
      "id": "7329416960",
      "userName": "Jcwilliams704",
      "userUrl": "https://itunes.apple.com/us/reviews/id75016076",
      "version": "6.8",
      "score": 1,
      "title": "Waste of time!",
      "text": "Should ask zip code to see if you service it before collecting my information! Complete waste of time and now you have my data for no reason!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-05-12T05:43:28-07:00"
    },
    {
      "id": "7328191861",
      "userName": "dizzle67",
      "userUrl": "https://itunes.apple.com/us/reviews/id932358346",
      "version": "6.8",
      "score": 1,
      "title": "Mobile price with Costco’s product",
      "text": "Yoshi advertise that they charge their consumer the lowest price in a 2 miles radius. So if that’s to be true. So if Mobile happens to be the cheapest price in a 2 miles radius. so let’s just say for arguments sake that mobil or Shell which advertise tech A part of their service that they advertise. Am I receiving that particular product at a discount price. something that Yoshi actually advertise the cheapest price in a 2 miles radius. Or am I receiving something else at a lesser value. Potentially do harm to my vehicle am I really going to put Costco‘s gas in myVehicle. I think not! so before you do your homework ask questions where exactly are you getting your product from. If you get it from Costco at a price of 3.79 or regular and 3.93 premium. And you selling it to me at 4.50 with a subscription of $20. I don’t see the full value.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-05-11T22:02:01-07:00"
    },
    {
      "id": "7244425983",
      "userName": "Michael Paul, Los angeles",
      "userUrl": "https://itunes.apple.com/us/reviews/id15749171",
      "version": "6.8",
      "score": 5,
      "title": "Enjoyable app",
      "text": "This app is easy to use, and it’s super easy to schedule and reschedule services. I wish I had heard of Yoshi sooner. I like the alerts and how it works with Onstar",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-04-20T11:15:06-07:00"
    },
    {
      "id": "7202808365",
      "userName": "Brian Williams",
      "userUrl": "https://itunes.apple.com/us/reviews/id24392205",
      "version": "6.8",
      "score": 5,
      "title": "Life saver and time saver",
      "text": "Nothing but great experiences with Yoshi! Even after the pandemic ends I won’t go back to gas stations!  Yoshi staff is very friendly and responsive to any questions! I love Yoshi and I tell everyone about it. The price is very reasonable when you think of all the time you save in a year!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-04-09T09:53:32-07:00"
    },
    {
      "id": "6986484325",
      "userName": "PCM76",
      "userUrl": "https://itunes.apple.com/us/reviews/id262161294",
      "version": "6.6",
      "score": 1,
      "title": "Signed me up then no service",
      "text": "This app gathered a bunch of information and started the clock on my free trial before telling me I wasn’t in a service area. A simple zip code check would have sufficed instead of forcing me to divulge my email, address, license plate, etc. My time was wasted and now they have a huge amount of info on me.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-02-12T11:54:51-07:00"
    },
    {
      "id": "6985982168",
      "userName": "washu1",
      "userUrl": "https://itunes.apple.com/us/reviews/id1006037730",
      "version": "6.6",
      "score": 5,
      "title": "Big Fan",
      "text": "First delivery today.  Attendant was very careful and this was cheapest gas in town.   App was simple to use  and  customer support was on top of everything!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-02-12T09:05:15-07:00"
    },
    {
      "id": "6893333937",
      "userName": "Cheeseataur",
      "userUrl": "https://itunes.apple.com/us/reviews/id109693664",
      "version": "6.5.1",
      "score": 1,
      "title": "App is terrible",
      "text": "Yoshi service is great but the app is terrible. \nIt always defaults to signing up for weekly fill ups. I just want a fill up on the day I choose. You always have to remember to change this when requesting service. I have also signed up for a fill up at 6:30 in the morning and somehow the app change the request time to late afternoon instead of the morning.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-01-20T11:09:55-07:00"
    },
    {
      "id": "6889990731",
      "userName": "Ian Bonham",
      "userUrl": "https://itunes.apple.com/us/reviews/id728246164",
      "version": "6.5.1",
      "score": 5,
      "title": "Great idea",
      "text": "Yoshi is great. I love not having to go to the gas station. The Yoshi app is fantastic, I don’t think I’ve ever had a problem with it. Having the customer service agent Rachele tied right to the app is fantastic , just send Rachele a text and she will take care of it immediately. The time I save is the beat part. This company is changing the game and helping save the environment at the same time. Thanks Yoshi!!!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2021-01-19T14:27:31-07:00"
    },
    {
      "id": "6583430667",
      "userName": "ND_esq",
      "userUrl": "https://itunes.apple.com/us/reviews/id17554218",
      "version": "6.2.1",
      "score": 1,
      "title": "Scam. Information collector",
      "text": "This is not a real app. They just collect your information. Do not give your real phone number/other info",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-10-28T08:55:35-07:00"
    },
    {
      "id": "6537683904",
      "userName": "Tsa0218",
      "userUrl": "https://itunes.apple.com/us/reviews/id197881069",
      "version": "6.2.1",
      "score": 5,
      "title": "Love!!",
      "text": "I absolutely love the convenience of using this app. The only problem I’m having is on fill up day I have to open and close out the app a couple times in order to put my location in. In all honesty that is such a little problem compared to how fantastic Yoshi is.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-10-15T06:25:29-07:00"
    },
    {
      "id": "6509488039",
      "userName": "colemichaellll",
      "userUrl": "https://itunes.apple.com/us/reviews/id372051782",
      "version": "6.1.2",
      "score": 1,
      "title": "Not Available in Calabasas",
      "text": "Surprised to see this company not up and running in the SFV. Will change my review if they come to this area. I’ve been searching for a service like this. Was excited but was let down. I live in Calabasas, CA, 91302 and work in Woodland Hills 91367.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-10-07T02:33:48-07:00"
    },
    {
      "id": "6503427785",
      "userName": "KYA2014",
      "userUrl": "https://itunes.apple.com/us/reviews/id43100015",
      "version": "6.1.2",
      "score": 5,
      "title": "Yoshi amazes me",
      "text": "I think this is the first review I’ve written and i did it because this service is extraordinary. And it saves me money. Lots of time and lots of money that i get back to myself",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-10-05T08:02:38-07:00"
    },
    {
      "id": "6459966610",
      "userName": "Lindsay Nash",
      "userUrl": "https://itunes.apple.com/us/reviews/id35367210",
      "version": "6.1.1",
      "score": 5,
      "title": "Game changer - consistently amazing! Highly accommodating to changes in location and schedule!",
      "text": "I’ve been using Yoshi for several months and they’ve been consistently reliable, accommodating to any change requests I give them (like when I switch locations at last minute), and being very quick to respond. I have enjoyed saving time by not having to fill up my SUV every week - Yoshi does it for me while I’m at work!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-09-23T06:57:06-07:00"
    },
    {
      "id": "6459620160",
      "userName": "stcfc",
      "userUrl": "https://itunes.apple.com/us/reviews/id426402610",
      "version": "6.1.1",
      "score": 5,
      "title": "Convenient",
      "text": "Love the convenience and no touch service.  Fuel is now one less thing that I need to deal with.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-09-23T05:06:47-07:00"
    },
    {
      "id": "6428758168",
      "userName": "Maximus FSU",
      "userUrl": "https://itunes.apple.com/us/reviews/id31894409",
      "version": "6.1",
      "score": 5,
      "title": "Amazing",
      "text": "Of all the startups out there aiming to make life a little easier, Yoshi is up at the top of our list.  With 2 little kids were constantly in danger of running late, and never having that “aw crap, I need gas” moment when you’re already late is so amazing.  And their gas is often cheaper than where I would normally fill up so the $16 a month is actually less than that when you factor those savings in.  Customer support is awesome too.  Seriously... give it a go.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-09-14T09:21:50-07:00"
    },
    {
      "id": "6381564498",
      "userName": "ShaMarian Robinson",
      "userUrl": "https://itunes.apple.com/us/reviews/id259378404",
      "version": "6.1",
      "score": 5,
      "title": "I love this!",
      "text": "This is soooooooooo convenient!!! I love not having to pump my own gas. It’s worth the money.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-08-31T11:57:32-07:00"
    },
    {
      "id": "6323563932",
      "userName": "moe-masri",
      "userUrl": "https://itunes.apple.com/us/reviews/id241966753",
      "version": "6.1",
      "score": 1,
      "title": "Why to ask for info if you don’t service my area",
      "text": "I did not appreciate the fact that I had to download the app, create an account to then be told they don’t service my area. And of course sent me an email. I don’t appreciate this tactic. Blocked their email address and will not use even they expand to my area",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-08-15T13:33:40-07:00"
    },
    {
      "id": "6307943055",
      "userName": "Mrs. Tri",
      "userUrl": "https://itunes.apple.com/us/reviews/id421469033",
      "version": "6.1",
      "score": 5,
      "title": "Kelley Y",
      "text": "How wonderful is it to walk outside to a spotless, fully-fuel car to drive home?! Amazing- superlative service with a courteous and professional staff.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-08-11T14:46:31-07:00"
    },
    {
      "id": "6253051521",
      "userName": "Rearden Metal",
      "userUrl": "https://itunes.apple.com/us/reviews/id19572537",
      "version": "6.0",
      "score": 1,
      "title": "Do you even serve my area?",
      "text": "They won’t say if they serve my area unless I download the app and then they immediately want all of these details about me and my car before I even know if they service my area. No thanks!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-07-28T15:13:49-07:00"
    },
    {
      "id": "6247876975",
      "userName": "muzicluvver",
      "userUrl": "https://itunes.apple.com/us/reviews/id39543694",
      "version": "6.0",
      "score": 5,
      "title": "Great value. Simple to navigate",
      "text": "I am not technologically hip. So thinking of using an app to manage a mechanical function like filling the gas tank sounded complicated. \nBut it is EASY. And so convenient. I can reschedule easily when necessary, have my tires checked as needed, and pay a very good price for the gasoline. The convenience and time savings more than make up for the reasonable service fee. I am a happy Yoshi supporter",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-07-27T07:08:17-07:00"
    },
    {
      "id": "6238529514",
      "userName": "1D58",
      "userUrl": "https://itunes.apple.com/us/reviews/id118605165",
      "version": "6.0",
      "score": 5,
      "title": "I love Yoshi",
      "text": "This is probably the best service ever! I cannot remember the last time I’ve actually been to a gas station. Yesterday my tire indicator came on and when I discovered that Yoshi checks tires, I fell even more in love!  Thank you for your service!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-07-24T20:02:13-07:00"
    },
    {
      "id": "6204581251",
      "userName": "unsatisfied and ripped off",
      "userUrl": "https://itunes.apple.com/us/reviews/id26317694",
      "version": "6.0",
      "score": 5,
      "title": "Awesome",
      "text": "I hope I never have to go to a gas station again. Feels like luxury.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-07-16T05:04:38-07:00"
    },
    {
      "id": "6088680588",
      "userName": "Tommers",
      "userUrl": "https://itunes.apple.com/us/reviews/id33761627",
      "version": "5.15.2",
      "score": 5,
      "title": "Quick, reasonable priced and responsive",
      "text": "My gas fill up, oil change and car wash we’re all booked very quickly and Yoshi was very responsive via text with suggestions",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-06-17T13:18:37-07:00"
    },
    {
      "id": "6026381813",
      "userName": "Brian875",
      "userUrl": "https://itunes.apple.com/us/reviews/id159536444",
      "version": "5.15.2",
      "score": 5,
      "title": "I was Amazed & I Love It!",
      "text": "Very fast. Dependable. Pricing is fantastic $",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-06-02T08:53:42-07:00"
    },
    {
      "id": "5992990763",
      "userName": "mikeyyapple",
      "userUrl": "https://itunes.apple.com/us/reviews/id606812237",
      "version": "5.15.1",
      "score": 1,
      "title": "Scam",
      "text": "DO NOT use this app..I got charged $20 today and I haven’t even used the app in months ! Watch out for shady charges",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-05-25T11:10:11-07:00"
    },
    {
      "id": "5941706709",
      "userName": "Davidmoss955",
      "userUrl": "https://itunes.apple.com/us/reviews/id246133479",
      "version": "5.15",
      "score": 1,
      "title": "DONT USE. THEY ARE SCAMMERS",
      "text": "I used this company for a while now. I have referred friends and family to be using this company and get them my referral code for them to see if they like it or not. To be honest they have horrible customer service and hardly show on time in the 4 hour gap they make you wait. Sometimes they even cancel on you saying that they can’t make it when you have been waiting during those 4 hours for them to fill up your car. Literally I have been paying for a service that I have not be able to use since they keep on canceling when they are not responsible and negligent. Just recently they accused my account of fraud (out of the blue) with out telling me. I tried to make an appointment for a fill up and it didn’t work and thought it was a glitch. I trying contacting them and still never got a reply. I had to go all the way to their website to try and find their email to contact them and after I told them I was having issues with my account they told me they flagged my account and canceled it claiming it was fraudulent. They claimed I had too many cars and addresses being put on the account. Hello, my car does not only go home- if I have more than one car I should be able to use it. If I have a rental car I should be able to use it. If my car is in a different location I should be able to use it. As long as my credit card is not being declined or being back charged claiming it’s fraud what can you say is fraudulent. Better of getting gas myself and not have to waste all my time waiting for them. They made me late to work several times and cost me money!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-05-13T15:29:13-07:00"
    },
    {
      "id": "5927570167",
      "userName": "kwamesmom",
      "userUrl": "https://itunes.apple.com/us/reviews/id22835548",
      "version": "5.15",
      "score": 2,
      "title": "Service discontinued in area without notice.",
      "text": "I loved the service. Weekly delivery. Saved time. Good rate. And then they cancelled me without explanation and refunded me. Even though I also had two months credit that would be added to the renew of my contract that I never got to use. Just terrible customer experience. If they’ve relocated out of the area. Just say that. If you’re bankrupt. Say it. Don’t just snatch away the service. But it doesn’t matter now with covid. But would be awesome during covid. Who wants to touch a gas pump even with gloves now.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-05-10T05:55:11-07:00"
    },
    {
      "id": "5910119398",
      "userName": "DC#11-USA",
      "userUrl": "https://itunes.apple.com/us/reviews/id373208702",
      "version": "5.14.2",
      "score": 5,
      "title": "Customer for Life",
      "text": "Seamless user interface through which the life changing (literally) service and quality of Yoshi’s team and product are delivered.  5 stars for the app that you’ll rarely need after initial setup as Yoshi “runs in the background” and removes the worries of gas fill-ups from your life, entirely.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-05-06T05:37:02-07:00"
    },
    {
      "id": "5797631942",
      "userName": "teenakey",
      "userUrl": "https://itunes.apple.com/us/reviews/id580994397",
      "version": "5.14.2",
      "score": 1,
      "title": "No Service",
      "text": "They don’t even service none of the addresses I inputted. I stay in a nice neighborhood as well.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-04-11T13:17:30-07:00"
    },
    {
      "id": "5747485546",
      "userName": "JW1029384756",
      "userUrl": "https://itunes.apple.com/us/reviews/id22142175",
      "version": "5.14.2",
      "score": 5,
      "title": "Very convenient",
      "text": "Yoshi is great! Love not having to think about getting gas - they fill up at my home or office and it’s super convenient!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-04-01T12:58:40-07:00"
    },
    {
      "id": "5734122368",
      "userName": "MsLuv2Shop",
      "userUrl": "https://itunes.apple.com/us/reviews/id267291656",
      "version": "5.14.2",
      "score": 5,
      "title": "Convenient",
      "text": "The amazon of fuel delivery. Conveniently affordable. No more touching gas station pumps for this germaphobe. Best thing since social media",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-03-29T22:19:36-07:00"
    },
    {
      "id": "5673143586",
      "userName": "Mihoke",
      "userUrl": "https://itunes.apple.com/us/reviews/id132148904",
      "version": "5.14.2",
      "score": 5,
      "title": "Excellent Service",
      "text": "Love Yoshi! Always polite and helpful.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-03-17T07:50:39-07:00"
    },
    {
      "id": "5668384775",
      "userName": "big loud 1",
      "userUrl": "https://itunes.apple.com/us/reviews/id3233753",
      "version": "5.14.2",
      "score": 5,
      "title": "Love my Yoshi!",
      "text": "One of life’s little hassles you never knew could go away has gone away!    Love my Yoshi!  Love Larry!  He fills me up.  Love Rachel who is always quick and kind when I text needing a change or to update.  LOVE that I can go all winter and never stand out in the freezing breeze trying to get gas while I’m running late.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-03-16T06:13:38-07:00"
    },
    {
      "id": "5666715586",
      "userName": "BEHunt11",
      "userUrl": "https://itunes.apple.com/us/reviews/id252337362",
      "version": "5.14.2",
      "score": 5,
      "title": "Perfect for our busy lives",
      "text": "This has been the best addition for us. On my day off or morning off, I know gas will be delivered and I don’t have to worry about it any other time. Saves us so much time and our Yoshi man is wonderful!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-03-15T21:05:56-07:00"
    },
    {
      "id": "5648797544",
      "userName": "ouis2438",
      "userUrl": "https://itunes.apple.com/us/reviews/id1003960251",
      "version": "5.14.2",
      "score": 1,
      "title": "Terrible Service",
      "text": "I inputted my work address and it said service unavailable in my area then I put my home address and it said service unavailable in your area then I input led a different area and it said the same what’s the point of all the locations aren’t being served waist of time honestly don’t bother",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-03-11T22:42:46-07:00"
    },
    {
      "id": "5579197982",
      "userName": "Jett173749392",
      "userUrl": "https://itunes.apple.com/us/reviews/id85640087",
      "version": "5.14",
      "score": 5,
      "title": "Game changer!",
      "text": "I cannot say enough great things about this service. They have the best communication and customer service. They go above and beyond. I had a flat tire once at work and they rerouted their technician to come help me out!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-02-25T08:23:51-07:00"
    },
    {
      "id": "5496787670",
      "userName": "Joey the Portuguese",
      "userUrl": "https://itunes.apple.com/us/reviews/id285948987",
      "version": "5.13.1",
      "score": 1,
      "title": "No diesel no Yoshi",
      "text": "I would give this zero stars if I could",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-02-06T14:11:26-07:00"
    },
    {
      "id": "5487192896",
      "userName": "KyleB06",
      "userUrl": "https://itunes.apple.com/us/reviews/id12584697",
      "version": "5.13.1",
      "score": 2,
      "title": "Payment Issues Galore",
      "text": "This is a great concept, except for the fact that every time they go to process my payment there is an error and they cancel the service I booked immediately, if I can even get that far.  What’s the use of offering this service if they can’t process the requests?",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-02-04T06:39:11-07:00"
    },
    {
      "id": "5480632444",
      "userName": "misniki20",
      "userUrl": "https://itunes.apple.com/us/reviews/id38364479",
      "version": "5.13.1",
      "score": 5,
      "title": "Great Improvement",
      "text": "When I started using this service a few months ago, they had major issues with keeping appointments.  It was very frustrating so I cancelled. They tried to gain me back but I declined until one day I told myself to try it again.  They said they hired more drivers and could now accommodate the demand and they were right. They have not cancelled an appointment yet. I’m a very satisfied customer now and very glad I came back to them.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-02-02T15:53:08-07:00"
    },
    {
      "id": "5458650046",
      "userName": "jclac",
      "userUrl": "https://itunes.apple.com/us/reviews/id277884567",
      "version": "5.13",
      "score": 5,
      "title": "Best service ever!",
      "text": "The most expensive thing at the gas station is your time. You can make more money, however you cannot make more time.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-01-28T05:56:23-07:00"
    },
    {
      "id": "5455060482",
      "userName": "Spidey405",
      "userUrl": "https://itunes.apple.com/us/reviews/id37601733",
      "version": "5.13",
      "score": 5,
      "title": "Great service!",
      "text": "I’",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-01-27T06:23:14-07:00"
    },
    {
      "id": "5453362892",
      "userName": "Zazzzzzzy",
      "userUrl": "https://itunes.apple.com/us/reviews/id192845999",
      "version": "5.13",
      "score": 5,
      "title": "Love the app!",
      "text": "Use it every week",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-01-26T19:41:44-07:00"
    },
    {
      "id": "5407117323",
      "userName": "styledbyroz",
      "userUrl": "https://itunes.apple.com/us/reviews/id129030642",
      "version": "5.12.1",
      "score": 2,
      "title": "Could be great, they need to fix some bugs..",
      "text": "I’m having a problem getting “ Rachael  or Arnold “ to solve my problem. I can’t get my gas delivered and it’s been 3 months  I’ve sent in all the documents that was asked of me and still no answers.. I’m looking for employment maybe I can assist.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-01-15T07:32:13-07:00"
    },
    {
      "id": "5400375809",
      "userName": "Customer@icici",
      "userUrl": "https://itunes.apple.com/us/reviews/id816808081",
      "version": "5.12.1",
      "score": 1,
      "title": "Total Crap",
      "text": "Frustrated mailing about the issue that it is not allowing to login as it is not sending the pin for login.\n\nTried mailing issue several times. No one responds to mails/text. 😡",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-01-13T17:11:04-07:00"
    },
    {
      "id": "5356278505",
      "userName": "Cani23",
      "userUrl": "https://itunes.apple.com/us/reviews/id379197197",
      "version": "5.12.1",
      "score": 1,
      "title": "Horrible customer service",
      "text": "Love this app idea. Gas delivery to your door with ease? Sign me up.. but make sure not to have any issues because customer service will not respond to you. Great app just dropped a ball on their service. I’ve emailed them 3 separate times in regards to account issues and a month later, still have not received any help. Save your time, go somewhere else. Cool concept but huge fail",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2020-01-03T09:15:28-07:00"
    },
    {
      "id": "5290225429",
      "userName": "kevin19900",
      "userUrl": "https://itunes.apple.com/us/reviews/id759275245",
      "version": "5.12.1",
      "score": 5,
      "title": "Best Amazon gas company",
      "text": "Yoshi is one of the best delivery gas company. Always applies on quickly when needed to change my service or add stuff. They have morning fill ups which is the best cause when I wake up my car is gas up and sends my a msg when my service is complete. Saves me time from having to go find the cheapest gas station during rush hours here in Los Angeles.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-18T23:23:39-07:00"
    },
    {
      "id": "5289176306",
      "userName": "Mr_Kidd27",
      "userUrl": "https://itunes.apple.com/us/reviews/id334812467",
      "version": "5.12.1",
      "score": 5,
      "title": "Great service",
      "text": "I’ve been using Yoshi for about 3 months and not only has it helped me save over $500 on gas but the service is spectacular how they deliver the gas to you. I don’t have to wait for long gas lines! Honestly highly RECOMMEND!!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-18T17:35:07-07:00"
    },
    {
      "id": "5289146765",
      "userName": "lonsrdaloc",
      "userUrl": "https://itunes.apple.com/us/reviews/id749520404",
      "version": "5.12.1",
      "score": 5,
      "title": "Amazing",
      "text": "Amazing app amazing service have already recommended to all my friends and coworkers",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-18T17:24:48-07:00"
    },
    {
      "id": "5289060929",
      "userName": "Holla-iz",
      "userUrl": "https://itunes.apple.com/us/reviews/id216403732",
      "version": "5.12.1",
      "score": 5,
      "title": "Yoshi make my life easier",
      "text": "Such a huge fan of Yoshi! I haven’t gone to a gas station for about half a year now and I am living for it! They make it so easy to reschedule, and give you plenty of notice day of if you need to make changes. Love that their extra services can contribute to savings on gas as well.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-18T16:47:00-07:00"
    },
    {
      "id": "5289035445",
      "userName": "Alli.Forrester",
      "userUrl": "https://itunes.apple.com/us/reviews/id30850107",
      "version": "5.12.1",
      "score": 5,
      "title": "Great Service! Easy to use app!",
      "text": "I really like using Yoshi. Not only is it convenient, but it’s safer, a time saver, and who likes getting out in the cold or heat anyways?! Yoshi is seriously a life saver.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-18T16:35:05-07:00"
    },
    {
      "id": "5288778356",
      "userName": "V.J.Miller",
      "userUrl": "https://itunes.apple.com/us/reviews/id691168474",
      "version": "5.12.1",
      "score": 4,
      "title": "Best Concept",
      "text": "My whole house uses Yoshi! We have 3 cars they service at our home and we love it. The concept alone is worth it, but the thoroughness in the service is even better. They are super clean and I never question if the gas actually came. I literally get at the minimum 2 photos to verify my fill up and the best part is they text the rest of my house when I have a fill up scheduled to see if they also need service.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-18T14:36:22-07:00"
    },
    {
      "id": "5288492078",
      "userName": "aarraajjaann",
      "userUrl": "https://itunes.apple.com/us/reviews/id618526851",
      "version": "5.12.1",
      "score": 5,
      "title": "Yoshi",
      "text": "Funny story. I used to be a smoker, buying cigarettes and gas was my gas station trip. I haven’t been to a gas station in a few months and neither have I smoked a cigarette. Thanks Yoshi.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-18T12:28:18-07:00"
    },
    {
      "id": "5288322800",
      "userName": "moviefacts",
      "userUrl": "https://itunes.apple.com/us/reviews/id141651107",
      "version": "5.12.1",
      "score": 5,
      "title": "Love Yoshi",
      "text": "I love using Yoshi! The app is super easy to use and customer service is always really helpful! Really convenient to not worry about having to get gas late after work or early, just schedule and leave my gas flap open!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-18T11:25:22-07:00"
    },
    {
      "id": "5288286146",
      "userName": "Ace9986",
      "userUrl": "https://itunes.apple.com/us/reviews/id9050007",
      "version": "5.12.1",
      "score": 5,
      "title": "Legit",
      "text": "This is legit the best thing I have found on the App Store. Yoshi saves so much time. Makes getting gas convenient.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-18T11:12:29-07:00"
    },
    {
      "id": "5288219886",
      "userName": "cjsmokey",
      "userUrl": "https://itunes.apple.com/us/reviews/id114932754",
      "version": "5.12.1",
      "score": 5,
      "title": "OUSTANDING SERVICE!!!!",
      "text": "I’ve been using yoshi since March this year and loving every minute of it. They have saved me over 400 bucks in gas and keeps my hands clean from pumping my own gas. If you haven’t at least tried it you are missing out. Yoshi is a life changer so get on the ball.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-18T10:49:31-07:00"
    },
    {
      "id": "5256613497",
      "userName": "Taar Taar",
      "userUrl": "https://itunes.apple.com/us/reviews/id187949250",
      "version": "5.12.1",
      "score": 5,
      "title": "GET YOSHI",
      "text": "I love the convenience. The GUARANTEED lowest price in the area. The time saved. I’m in Cleveland OH, so not having to deal with the ever changing (snow/rain) weather conditions! I can’t imagine being without YOSHI!!! Get it, you will love it!!!!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-10T09:45:22-07:00"
    },
    {
      "id": "5253213864",
      "userName": "LAgirl'nDC",
      "userUrl": "https://itunes.apple.com/us/reviews/id329026571",
      "version": "5.12.1",
      "score": 1,
      "title": "Great idea gone bad",
      "text": "Sounds great, until they continuously flag your account for fraud— request you send over copies of your license, debit card, vin, etc. When they notice you’re of color they will follow up with an email saying that despite all your very personal information being legit,  their team has randomly (with no reason) decided you can’t use their platform.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-09T11:22:32-07:00"
    },
    {
      "id": "5233785967",
      "userName": "garrett_okgo",
      "userUrl": "https://itunes.apple.com/us/reviews/id103427008",
      "version": "5.12.1",
      "score": 5,
      "title": "Yoshi is the future and the future is BRIGHT",
      "text": "I love this service! I regularly forget to fill my car with gas, and end up having to plan around it at the worst times. Not anymore! I have been a faithful Yoshi member for 2.5 years, and I’ll never go back.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-04T14:07:51-07:00"
    },
    {
      "id": "5233162488",
      "userName": "mctrader725",
      "userUrl": "https://itunes.apple.com/us/reviews/id123942856",
      "version": "5.12.1",
      "score": 5,
      "title": "Yoshi!!",
      "text": "Outstanding service. I love this service and the savings I receive!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-04T09:35:10-07:00"
    },
    {
      "id": "5229542538",
      "userName": "JmendezGT",
      "userUrl": "https://itunes.apple.com/us/reviews/id341263476",
      "version": "5.12.1",
      "score": 1,
      "title": "Broken? Can’t even use.. SKETCHY DONT USE",
      "text": "I downloaded the app and the first thing is to put in my phone number. Well I’ve tried several times and I don’t get a pin, so I can’t use it. \n\nNo option to call. No option to make an account online. No option to verify via outbound text or by email.\n\nOkay well I guess I’m not using your service then\n\nUpdate!! SUPER sketchy stuff that they’re doing\n\ntried to make a new account today with a new number. Both my accounts were flagged for “fraudulent activity” and they closed them, took away my credits, and left my card on the new account so it would be auto charged \n\nWhen I contacted support they refused to talk to me because they said the number I was texting them on was not on any accounts. Did not offer other way for me to talk to them",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-03T10:54:05-07:00"
    },
    {
      "id": "5226849178",
      "userName": "BrushWithCrest",
      "userUrl": "https://itunes.apple.com/us/reviews/id628406288",
      "version": "5.12.1",
      "score": 5,
      "title": "Gas at its finest",
      "text": "This is a great idea for gas and the pricing is always lower than your local gas. Did I mention you need to make almost no effort, just need a 4 hour window where you car will be parked they come to you and fill up your vehicle. Also the gas used is quality gas. I used them for all my vehicles \n\nUse promo code Dannys3f95 for .99 gas",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-12-02T18:12:53-07:00"
    },
    {
      "id": "5199828397",
      "userName": "Svenerd3",
      "userUrl": "https://itunes.apple.com/us/reviews/id241739727",
      "version": "5.12.1",
      "score": 1,
      "title": "Horrible customer serivice",
      "text": "Drivers consistently had issue finding my vehicle in its exact pinned location. Customer service is horrible and not worth the $.05-$.06 and 7 minutes a week they were saving me.  App could be much better.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-26T07:18:56-07:00"
    },
    {
      "id": "5194981170",
      "userName": "Rogo1959",
      "userUrl": "https://itunes.apple.com/us/reviews/id739602667",
      "version": "5.12.1",
      "score": 5,
      "title": "Great service",
      "text": "Great service, they only lost me once..",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-25T02:34:00-07:00"
    },
    {
      "id": "5193553421",
      "userName": "DONT RIDE DIRTY",
      "userUrl": "https://itunes.apple.com/us/reviews/id488469533",
      "version": "5.12.1",
      "score": 5,
      "title": "Fuel Concierge",
      "text": "I started a gas delivery company I own the App my name is Anthony Ceo & Founder I have the right to this logo and Name trademark in the uspto I’m looking for a acquisition 🤷🏾‍♂️",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-24T17:19:32-07:00"
    },
    {
      "id": "5182119720",
      "userName": "Mark Robert",
      "userUrl": "https://itunes.apple.com/us/reviews/id37994618",
      "version": "5.12.1",
      "score": 5,
      "title": "The Best App and Service",
      "text": "If you’ve never had someone take car while you are taking care of the rest of your busy day, you’re missing out! Try it for a month and you’ll never want to pull into a gas station again!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-22T08:57:20-07:00"
    },
    {
      "id": "5145550901",
      "userName": "quidam1408",
      "userUrl": "https://itunes.apple.com/us/reviews/id527133840",
      "version": "5.12.1",
      "score": 5,
      "title": "Best car service ever",
      "text": "The convenience of Yoshi coming to my workplace and pumping my gas is amazing! My tank is almost always full! They price match within 2 miles so gas is often $.20 less per gallon than anything near home. My company pays for the membership so I’m actually saving money and so much time with Yoshi. Highly recommend!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-15T18:21:34-07:00"
    },
    {
      "id": "5143707798",
      "userName": "chanellnumba5",
      "userUrl": "https://itunes.apple.com/us/reviews/id645596788",
      "version": "5.12.1",
      "score": 1,
      "title": "DONT DO IT !!!!!",
      "text": "I have requested to cancel my membership for 4 weeks now. All of a sudden their customer service text number is not responding , the app does not allow you to cancel in your own they have to do it for you. But no one will answer, they have charged my account for services that I did not want and asked to have canceled. I have to go through the hassle of disputing this charge through my bank because these idiots won’t cancel this membership. do not sign up with this company , you will never get your gas filled and will just be charge a monthly membership fee for absolutely nothing !!!! Stay away from this company",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-15T10:49:21-07:00"
    },
    {
      "id": "5142784447",
      "userName": "N2med51",
      "userUrl": "https://itunes.apple.com/us/reviews/id87678443",
      "version": "5.12.1",
      "score": 5,
      "title": "Huge Time Saver",
      "text": "Great option to fast gas service. Saves tons of time for this Trauma RN",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-15T07:35:47-07:00"
    },
    {
      "id": "5123641344",
      "userName": "Ms lmg",
      "userUrl": "https://itunes.apple.com/us/reviews/id466316771",
      "version": "5.12.1",
      "score": 5,
      "title": "No freezing at a gas station in winter",
      "text": "I’ve been with Yoshi since the beginning, and I love this service. They bring me gas , change my oil , fill my tires with air.  Time is something we don’t have a lot of, and it saves me time. I also don’t have to stand at a pump in -22 degree weather. It may seem like pumping gas doesn’t take a lot of time .. but when you’re outside In the cold every second seems like an eternity. Love my Yoshi service .",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-11T07:32:38-07:00"
    },
    {
      "id": "5121335790",
      "userName": "Fritomnky",
      "userUrl": "https://itunes.apple.com/us/reviews/id252970543",
      "version": "5.12.1",
      "score": 5,
      "title": "Love the time I save.",
      "text": "Seriously one of the best time savers in my life. I hate having to stop before or after work, and with the cold season setting in...I'm excited to not have to go out to fill up!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-10T18:39:29-07:00"
    },
    {
      "id": "5101094278",
      "userName": "Castillo562",
      "userUrl": "https://itunes.apple.com/us/reviews/id942433428",
      "version": "5.12.1",
      "score": 1,
      "title": "Bad customer service.",
      "text": "They sent me an email stating they where going to cancel my membership tried messaging them and emailing them for a week and no response. Have two credits for 60c a fill up and they will go to waste on the 11th since app not letting me schedule a fill up service. Savings are great. But they constantly cancel or show up hours after your scheduled window. Many of my friends say it’s an inconvenience, basically has to be a day where your car sits all day.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-07T16:31:12-07:00"
    },
    {
      "id": "5087088508",
      "userName": "r2d2oflongbeach",
      "userUrl": "https://itunes.apple.com/us/reviews/id155297831",
      "version": "5.12.1",
      "score": 5,
      "title": "I love not going to the gas station",
      "text": "I just get a full tank every so often and I’m good no waiting in lines or trying g to go on my break. They come to my work fill it up :) I love it!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-04T16:05:17-07:00"
    },
    {
      "id": "5085954300",
      "userName": "Brookewake",
      "userUrl": "https://itunes.apple.com/us/reviews/id363771756",
      "version": "5.12.1",
      "score": 5,
      "title": "Yoshi is amazing!",
      "text": "I had no idea how incredible gas service and car wash service was until I got Yoshi.  It is a game changer.  My car looks brand new after it’s washed.  They are very flexible if you need to change dates and everyone there is so nice!  I highly recommend them!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-04T09:36:33-07:00"
    },
    {
      "id": "5085514118",
      "userName": "luis81818",
      "userUrl": "https://itunes.apple.com/us/reviews/id600141922",
      "version": "5.12.1",
      "score": 1,
      "title": "charge you for gas they dont put in",
      "text": "my gas tank was 1/4 gas and fill up and charge me for almost 13 gallons my car is acura ilx fits 13 gallons. my gas tank was not empty when they fill it up.  i compare it on a gas station sane price and milage and was 9 gallons i could fit on it. charge me almos 4 gallons more that they did not put. happen to me twice delete the app",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-04T07:56:21-07:00"
    },
    {
      "id": "5084638475",
      "userName": "ShugHolmes",
      "userUrl": "https://itunes.apple.com/us/reviews/id104041427",
      "version": "5.12.1",
      "score": 5,
      "title": "5 Stars",
      "text": "I love this service. Not having to think about gas ever has saved me countless hours in time and money. I absolutely love it, the customer service is phenomenal!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-04T05:05:05-07:00"
    },
    {
      "id": "5065681807",
      "userName": "Namie name Namie",
      "userUrl": "https://itunes.apple.com/us/reviews/id217899950",
      "version": "5.12.1",
      "score": 5,
      "title": "So convenient!",
      "text": "Robert and Adam were a huge help and Gary did an amazing job on my car wash. Very speedy, waited less than 10 minutes before I was serviced. I also love the customer service aspect, Rachel is awesome and I prefer being able to text over talking on the phone. Will highly recommend.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-11-01T17:37:09-07:00"
    },
    {
      "id": "5047804078",
      "userName": "Perfect2me2",
      "userUrl": "https://itunes.apple.com/us/reviews/id367542310",
      "version": "5.12.1",
      "score": 1,
      "title": "Horrible",
      "text": "I feel like they have too many members and not enough employees to handle the workload. They cancel a lot and I don’t like that you can’t call the company you can only text. I have referred a lot of people to them and I feel it’s been a disappointment. The first fill up is always good but after that your going to be disappointed. Really thought this was going to be a good company but it’s bs. I’m complaining every week or every other week. They have an excuse for everything. Waste of time.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-29T15:40:45-07:00"
    },
    {
      "id": "5046844464",
      "userName": "Sheldon1231234",
      "userUrl": "https://itunes.apple.com/us/reviews/id324694722",
      "version": "5.12.1",
      "score": 1,
      "title": "Bad service",
      "text": "Really bad service. Would cancel every time. Would charge more. I would not recommend this to anyone",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-29T10:58:42-07:00"
    },
    {
      "id": "5012659626",
      "userName": "GuffDiver",
      "userUrl": "https://itunes.apple.com/us/reviews/id40823999",
      "version": "5.12.1",
      "score": 5,
      "title": "Smart & convenient!",
      "text": "As a working mother with a husband that travels for work, so many things fall under my responsibility that could normally be shared with a spouse. Things that Yoshi has released from my worry-bucket: having a full tank of gas every week, oil changes, car washes, wiper blades & rainX. It’s the MOST convenient service and everyone that finds out is so jealous of me until they get over themselves and try it!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-25T06:01:00-07:00"
    },
    {
      "id": "4993763705",
      "userName": "RcoolJxcvb",
      "userUrl": "https://itunes.apple.com/us/reviews/id341071435",
      "version": "5.12.1",
      "score": 1,
      "title": "The worst",
      "text": "Trash.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-21T10:50:11-07:00"
    },
    {
      "id": "4947131453",
      "userName": "GeeBo40",
      "userUrl": "https://itunes.apple.com/us/reviews/id789665602",
      "version": "5.12",
      "score": 1,
      "title": "My account got flagged for fraudulent activity",
      "text": "I used Yoshi once then recommended my wife and she used Yoshi and I also recommended 4 friends, today I was scheduled for my second fill up with 50 cents credit per gallon but yesterday I received a text stating that my card was declined for the transaction for today so I got up on my day off to go put the money in my account and text them back and told them to charge my card now,they said ok and then I received a text saying my account was flagged for fraudulent activity, How?!!!! Especially since I’m using my debit card and my same card I used last week, now no one is responding and i feel like I got cheated out of my fill up",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-14T09:45:45-07:00"
    },
    {
      "id": "4920180946",
      "userName": "boytsu",
      "userUrl": "https://itunes.apple.com/us/reviews/id418097819",
      "version": "5.12",
      "score": 1,
      "title": "Horrible",
      "text": "Every time I order my appointment get canceled, they’re definitely doing to much work that they can not handle I’ve gotten canceled for 6 days in a row now. It’s ridiculous, cheap gas and delivered gas is a great idea super convenient but this app can not execute this type of service. All i end up getting is a text with an empty apology that’s wasting my unlimited texting plan",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-10T15:02:17-07:00"
    },
    {
      "id": "4919349283",
      "userName": "919loves443",
      "userUrl": "https://itunes.apple.com/us/reviews/id750262833",
      "version": "5.12",
      "score": 5,
      "title": "LIFE SAVERS!",
      "text": "I have been using this company for about a year now, and have no complaints whatsoever!\nThe cherry on top is being able to schedule a last minute fill-up as I cruised into my garage at work with only two miles left in the tank. Rachel and the team were super helpful, and had me filled up and on my way(without needing Uber) before leaving for the day. Do yourself a favor and download this app and service. You can thank me later!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-10T10:45:11-07:00"
    },
    {
      "id": "4918548351",
      "userName": "kaittieees",
      "userUrl": "https://itunes.apple.com/us/reviews/id909805882",
      "version": "5.12",
      "score": 4,
      "title": "Yoshi Review",
      "text": "Overall the app is very convenient, however the customer service via text messages is not so great.  Yoshi need an actual number to call to speak to someone directly versus waiting for a text response.  Also, stop canceling customers the day of, we take 5 hours out of our day to wait for you guys to show up only for you to cancel.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-10T07:07:45-07:00"
    },
    {
      "id": "4915573620",
      "userName": "bicksboogie",
      "userUrl": "https://itunes.apple.com/us/reviews/id632920217",
      "version": "5.12",
      "score": 5,
      "title": "Love it.",
      "text": "Convenient, great customer service and even with the $20 monthly fee, it’s like paying someone a couple bucks to take your car to the gas station.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-09T16:24:35-07:00"
    },
    {
      "id": "4906167444",
      "userName": "G•W¡Z",
      "userUrl": "https://itunes.apple.com/us/reviews/id28488104",
      "version": "5.12",
      "score": 5,
      "title": "Yoshi hooks it up",
      "text": "Too many good things to say about these guys; the customer service is remarkable",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-07T13:18:55-07:00"
    },
    {
      "id": "4887213195",
      "userName": "Fnnakn",
      "userUrl": "https://itunes.apple.com/us/reviews/id293618557",
      "version": "5.12",
      "score": 1,
      "title": "Worst Communication",
      "text": "Never was updated that I wasn’t going to be able to get gas. I gave a broad window 9-4 and still nothing. This is so upsetting. Don’t waste your time trying to get happy with this app. Makes promises they can’t complete!! Now I’m left with 6 gas miles on my car because I was expecting them to come fill up my tank. \n\nCan I rate this a BUG FAT ZERO!!!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-04T16:51:46-07:00"
    },
    {
      "id": "4886485743",
      "userName": "aynooah",
      "userUrl": "https://itunes.apple.com/us/reviews/id344619281",
      "version": "5.12",
      "score": 5,
      "title": "Love having my fuel delivered",
      "text": "So happy with the customer service and the friendly techs that come fill up my cars twice a week! \nVery grateful with how they handle their customers and schedule their customers. \n\nI have never had a bad experience with them! \nThey’re always so friendly, and I get really good gas prices!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-04T14:15:59-07:00"
    },
    {
      "id": "4870979782",
      "userName": "therealmccoy21",
      "userUrl": "https://itunes.apple.com/us/reviews/id35915806",
      "version": "5.11",
      "score": 5,
      "title": "Go Yoshi Go!",
      "text": "Where have you been all my life!!!!\nYoshi is everything I thought it would be!\nGo Yoshi Go!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-10-01T16:31:54-07:00"
    },
    {
      "id": "4866836806",
      "userName": "AzeemPlease",
      "userUrl": "https://itunes.apple.com/us/reviews/id375506820",
      "version": "5.11",
      "score": 1,
      "title": "Disappointed",
      "text": "Hi Albert, unfortunately we are experiencing high levels of orders and could not find a place on our routes for your Charger today. We apologize for any inconvenience. Please let us know if any other days work for you and we will search for a place on our routes. - Rachel\n   Imagine being told this after waiting the whole weekend. From 1:30pm Friday to Monday afternoon following being cancelled once more before. The promotion is either misleading or unsustainable either way it has left my order unfulfilled and my time wasted. (No I didn’t not sit at home the whole time waiting on gas.)",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-30T16:48:12-07:00"
    },
    {
      "id": "4865283193",
      "userName": "itsslexuss",
      "userUrl": "https://itunes.apple.com/us/reviews/id115813085",
      "version": "5.11",
      "score": 1,
      "title": "DISAPPOINTED!!!",
      "text": "So far I’m disappointed. So I signed up to use the app for gas and I have scheduled an appointment numerous times in north Long Beach, CA and Carson, CA and I continuous keep getting a text that they have a high volume that day. I have tried on different days of the week and the same thing keeps happening. Than the day my appointment is confirmed from 9-2 they wasn’t even in route 10 mins before 2pm and canceled it saying my card declined but there was nothing wrong with that card and didn’t give me a chance to re enter the card information. So far highly disappointed",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-30T07:40:53-07:00"
    },
    {
      "id": "4838000398",
      "userName": "LovelyElleV",
      "userUrl": "https://itunes.apple.com/us/reviews/id244292181",
      "version": "5.11",
      "score": 5,
      "title": "Yoshi",
      "text": "I really love Yoshi services. They are so accommodating and I will continue to use them",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-25T17:06:03-07:00"
    },
    {
      "id": "4837193988",
      "userName": "idontknoewhat",
      "userUrl": "https://itunes.apple.com/us/reviews/id521773587",
      "version": "5.11",
      "score": 1,
      "title": "This makes me mad",
      "text": "I have tried to fill my tank up multiple times and it never works on my phone, im literally trying to put my new car into the app and it will not let me search my car , there is alot going on with this app and I need answers like immediately i have gotten so many people onto this app and it won’t even work for me , i have a iphone 8 plus there should not be a problem",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-25T12:18:29-07:00"
    },
    {
      "id": "4831986680",
      "userName": "aschwebbie",
      "userUrl": "https://itunes.apple.com/us/reviews/id39001381",
      "version": "5.11",
      "score": 5,
      "title": "Couldn’t be better",
      "text": "This service could not be better. Customer service is excellent.  I love this.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-24T05:33:09-07:00"
    },
    {
      "id": "4829659259",
      "userName": "Paul & Anita",
      "userUrl": "https://itunes.apple.com/us/reviews/id12971509",
      "version": "5.11",
      "score": 5,
      "title": "Spoiled",
      "text": "It’s really nice to not have to stop for fill ups any more. And the price Yoshi charges me is less than the stations near my house. So it’s an all around win for me. Time saving + money savings = a no brainer win. Thanks Yoshi for the great service!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-23T13:44:52-07:00"
    },
    {
      "id": "4809681632",
      "userName": "GroovyUno",
      "userUrl": "https://itunes.apple.com/us/reviews/id621725775",
      "version": "5.11",
      "score": 1,
      "title": "Florida",
      "text": "When will the app be available in West Palm Beach, Orlando or Tampa area?",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-20T06:57:03-07:00"
    },
    {
      "id": "4806167453",
      "userName": "Jeyyloveeeeeey",
      "userUrl": "https://itunes.apple.com/us/reviews/id313760613",
      "version": "5.11",
      "score": 2,
      "title": "Always Cancelling",
      "text": "I have referred 6 or 7 people to use this service. Some have filled so I received my promo others keep getting cancelled on. This week I have tried getting gas with my 50 cent promo 3 times but they say their is no technician near my area. My co worker and I requested service the same day for the next day. She got her gas parked next to me but mine got cancelled because of their bs reasons. This is a waste of time, my cars been low on gas and their customer service rep is no help at all. I will be requesting my money back for the member ship fee. This app is only good for a 2 time use during trial. Don't waste your money on keeping the member ship. Use those 20 and pump gas at your closest gas station.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-19T15:56:02-07:00"
    },
    {
      "id": "4805908722",
      "userName": "Pinkunicorns19",
      "userUrl": "https://itunes.apple.com/us/reviews/id102768258",
      "version": "5.11",
      "score": 1,
      "title": "They’re just horrible. Not even kidding",
      "text": "Dude,\n\nSo my family kept raving and raving about this freaking app mostly cause they were trying to get that 50 cent fill up or whatever. Man, so my first fill up was miraculous to say the least. After canceling 4 days in a row, I guess somebody just accepted my order. Fast forward a week later and my husband needed to fill his car up, I mention them hoping they’d might respond faster, but sure enough. They didn’t! Having canceled literally 4 days in a row again. On the day it finally was scheduled , they texted me saying referral abuse and I’d be charged a delivery fee for services I did not receive. Me and my husband have 2 different cars in the same household. So they cancelled his account.  This by far have been the worst subscription I have ever been signed up for. I will be canceling my account and removing this app immediately! They definitely just lost a customer!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-19T14:32:18-07:00"
    },
    {
      "id": "4801901413",
      "userName": "tina@20",
      "userUrl": "https://itunes.apple.com/us/reviews/id1075376279",
      "version": "5.11",
      "score": 1,
      "title": "Horrible",
      "text": "This app is super frustrating when you forgotten your password and tired every thing to contact and reach out to fix the problem.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-18T17:54:52-07:00"
    },
    {
      "id": "4797314337",
      "userName": "lordbubbaj",
      "userUrl": "https://itunes.apple.com/us/reviews/id514195124",
      "version": "5.11",
      "score": 1,
      "title": "Bad Service! Unreliable!",
      "text": "When I was told about Yoshi I said it was good idea. So I do my membership and Schedule my first fillup...  it never happened. So I decide to do another fillup and again ... it never happened. From there I said I’ll give it three tries. So I book for another fillup, One week ahead for today. I had a alignment appointment for 3 pm. Yoshi asks for a 4 hour window minimum. So I scheduled 9 am - 2 pm.  I got that fabulous text from Yoshi in the morning saying my truck has now been scheduled for today. So you know they have this promotion going on where you use a recommendation code you get your tank for 99c. Who doesn’t want that!? On my time window it said estimated time arrival from 9:30 to 11:30 pm. They were not showing up so my ETA started going higher and higher and higher until it said they were late so I waited one more hour and nothing. So I cancelled told them their UNRELIABLE. Especially booking one week ahead. DO NOT WASTE YOUR TIME WITH THIS COMPANY. GREAT IDEA BUT HARSH SERVICE.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-17T15:13:05-07:00"
    },
    {
      "id": "4797279929",
      "userName": "AFK Hou",
      "userUrl": "https://itunes.apple.com/us/reviews/id176564690",
      "version": "5.11",
      "score": 5,
      "title": "Safety & Convenience",
      "text": "At first I thought paying a subscription fee for someone to fill my car with gas was a frivolous unnecessary expense. Then I realized many benefits:\n1) no danger having my credit card skimmed at the pump. \n2) no danger of getting mugged or robbed at the gas station. \n3) i don’t have to stand in the blistering summer heat or rain to fill my tank. \n4) I get competitively priced gas!\n\nIn the end I decided those benefits were worth the small monthly fee. Plus I signed up for regular tire pressure readings and my tires stay properly inflated always now.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-17T14:59:01-07:00"
    },
    {
      "id": "4792908870",
      "userName": "Nask19",
      "userUrl": "https://itunes.apple.com/us/reviews/id753278133",
      "version": "5.11",
      "score": 5,
      "title": "Convenience at its best!",
      "text": "Nowadays you can get anything delivered to you, even gas for your car!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-16T14:40:48-07:00"
    },
    {
      "id": "4771000460",
      "userName": "Juniedread27",
      "userUrl": "https://itunes.apple.com/us/reviews/id659199657",
      "version": "5.11",
      "score": 2,
      "title": "Where the service at",
      "text": "I tired to get gas every single day of this week and everyday is the same message. \n\n“Hi Lyndon Bailey, unfortunately we are experiencing high levels of orders and could not find a place on our routes for your 5 Series today. We apologize for any inconvenience. Please let us know if any other days work for you and we will search for a place on our routes.” \n\nFor 5 days straight 2 different locations",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-13T11:42:07-07:00"
    },
    {
      "id": "4767030311",
      "userName": "janetcan",
      "userUrl": "https://itunes.apple.com/us/reviews/id1051505841",
      "version": "5.11",
      "score": 5,
      "title": "Yoshi forever",
      "text": "I been using Yoshi for over a month. Not disappointed one bit. Even had Yoshi to come to a location other than home. Not a problem.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-12T15:38:01-07:00"
    },
    {
      "id": "4765491507",
      "userName": "sammiesamsam89",
      "userUrl": "https://itunes.apple.com/us/reviews/id344275551",
      "version": "5.11",
      "score": 1,
      "title": "Canceled every single time",
      "text": "Tried to use this app five times. They canceled every single time due to high volume. They need to manage their trucks and schedule better.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-12T07:12:52-07:00"
    },
    {
      "id": "4758222014",
      "userName": "bad yoshi",
      "userUrl": "https://itunes.apple.com/us/reviews/id86031789",
      "version": "5.11",
      "score": 1,
      "title": "False advertising",
      "text": "The company never fill you up for a whole 2months",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-10T12:46:50-07:00"
    },
    {
      "id": "4754699676",
      "userName": "jimmy1223456",
      "userUrl": "https://itunes.apple.com/us/reviews/id132329733",
      "version": "5.11",
      "score": 1,
      "title": "Advertises more than it can deliver",
      "text": "I’m all about saving time especially if it is something that I don’t love doing. The concept of this is great, but the follow through on the company side is seriously\nlacking.  My appointment to have my gas filled up was cancelled without me being notified.  I contacted a customer service person about it & they offered to reschedule to a different day & said they have to do that frequently when their schedules get “overbooked”.   The time I wasted dealing with that & trying to workout rescheduling could have easily been avoided by stopping for my own gas.  Until they have enough people to actually provide a service they claim I will be filling up my own gas tank so I know it is done & completed when I need it.  I am cancelling my membership & will not be returning.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-09T13:45:38-07:00"
    },
    {
      "id": "4737240659",
      "userName": "Parrothead1976",
      "userUrl": "https://itunes.apple.com/us/reviews/id34365599",
      "version": "5.10",
      "score": 2,
      "title": "Almost there",
      "text": "Unfortunately I did not have a good experience with this service. Multiple times they change my service dates which screws up my entire schedule. I am giving them two stars for customer service because they are extremely nice but are extremely disorganized. My car does not sit in one place so I cannot just let them come whenever they feel like it. If you are a office job individual it’s probably a great service for you but for me unfortunately no good",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-06T11:06:57-07:00"
    },
    {
      "id": "4730260817",
      "userName": "FKelley",
      "userUrl": "https://itunes.apple.com/us/reviews/id249572239",
      "version": "5.10",
      "score": 5,
      "title": "Amazing",
      "text": "I hate going to the gas station!!! This is a service every single woman should take advantage of!!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-09-05T05:20:30-07:00"
    },
    {
      "id": "4696820671",
      "userName": "ladyblaccc",
      "userUrl": "https://itunes.apple.com/us/reviews/id897922887",
      "version": "5.10",
      "score": 3,
      "title": "Yoshi",
      "text": "I am very grateful an happy for services provided my only issue is the waiting on my scheduled day it may say they will be here approximately at 10 but don’t receive services till after 4pm so it puts me in a bind I’m sure due to it being a newer company they are just short staffed tho so overall I’m happy",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-30T09:09:51-07:00"
    },
    {
      "id": "4696644533",
      "userName": "David P. Tusa",
      "userUrl": "https://itunes.apple.com/us/reviews/id172158852",
      "version": "5.10",
      "score": 2,
      "title": "Not All What It’s Hyped To Be",
      "text": "It’s a great idea but here are the issues I have experienced:\n\n- Rarely do they show up at the time you set in the app. Well over 75% of the time, the service has to be rescheduled.\n\n- the send random texts advising of tomorrow’s service when there is no service scheduled tomorrow.\n\n- they charge erroneous fuel delivery charges and you have to complaint to secure a refund.\n\n- lots of bugs in the app; seems more like a beta version they are testing on customers.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-30T08:32:25-07:00"
    },
    {
      "id": "4682371670",
      "userName": "ed.vel",
      "userUrl": "https://itunes.apple.com/us/reviews/id461594826",
      "version": "5.10",
      "score": 1,
      "title": "Wack",
      "text": "Too good to be true",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-27T10:36:48-07:00"
    },
    {
      "id": "4661283129",
      "userName": "Hippyskee",
      "userUrl": "https://itunes.apple.com/us/reviews/id114007486",
      "version": "5.10",
      "score": 1,
      "title": "Bad service",
      "text": "I schedule my gas delivery service 2 days before the day i needed it. They sent me an email saying everything was on track. On the day i was supposed to get my service they send me a text message saying the driver was on its way and a couple of minutes after i got another text message saying my order was cancelled as well as my account due to fraudulent activity. Tried to text “Rachel” and she said to send a email, so I did and it’s been 3 days and nobody has written back to me. I don’t think i’ll use their service anymore.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-23T11:49:56-07:00"
    },
    {
      "id": "4652366282",
      "userName": "Youshi Bev",
      "userUrl": "https://itunes.apple.com/us/reviews/id494398775",
      "version": "5.10",
      "score": 5,
      "title": "YOSHI IS AN ABSOLUTELY AMAZING SERVICE",
      "text": "What a great Idea....gas delivery to your home plus other great services as well like oil change, wiper blades, tire check, car wash and more. As a female I love not having to stop to get gas...especially at night. And the promotion of .99 per gallon is better than a “Groupon” coupon. The quality of gas is top notch! For some reason\nI think it seems to burns slower. My second fill request got cancelled because the idea is catching on in the LA area and the demand was really high that day. YOSHI made it up to me and the next fill price was better than the .99 cent. I have passed the promotion onto several friends and family who love YOSHI too!  Rachel is my Custoner Serv Rep and she is always prompt with responses and very knowledgeable and friendly. Best thing I’ve ever signed up for. \nDon’t miss out!! Sign up now. You won’t regret it!!\nBev",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-21T18:25:59-07:00"
    },
    {
      "id": "4642962291",
      "userName": "kinglouiemejia",
      "userUrl": "https://itunes.apple.com/us/reviews/id684455581",
      "version": "5.9",
      "score": 1,
      "title": "Unreliable",
      "text": "They Cancelled after waiting 5 hours. Can’t reschedule because tomorrow they’re going to do the same thing. Everyday is the same thing. Save your time and go fill up on your own. Relying on these people will have you being late to everything. They need a 4 hour window but never show up or just cancel in the middle of the day. ETA inaccurate. Do you realize how much of a inconvenience that is after waiting hours for a service that never shows up?",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-19T14:00:59-07:00"
    },
    {
      "id": "4626468504",
      "userName": "kainhai",
      "userUrl": "https://itunes.apple.com/us/reviews/id666899610",
      "version": "5.9",
      "score": 4,
      "title": "YooShi",
      "text": "Love YOSHI the only thing I don’t like is the cancellations due to being overbooked",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-16T12:29:25-07:00"
    },
    {
      "id": "4615011570",
      "userName": "Acd0304",
      "userUrl": "https://itunes.apple.com/us/reviews/id304001339",
      "version": "5.9",
      "score": 5,
      "title": "Why haven’t you signed up yet ?",
      "text": "Who ever came up with this app is a pure GENIUS!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-14T05:00:56-07:00"
    },
    {
      "id": "4611675716",
      "userName": "Makeupjunkee",
      "userUrl": "https://itunes.apple.com/us/reviews/id266624082",
      "version": "5.9",
      "score": 1,
      "title": "Unreliable",
      "text": "I was scheduled for a fill up. Received confirmation the day of,they reached out to make sure I was still parked in the same spot. Then they text me a few hours later saying we’re booked so you can reschedule in the app if you want. If you’re booked why was I able to schedule and CONFIRM my service? I made sure to fix my schedule around this service and they completely disregard my time. Now that I’m reading reviews it clearly is a common issue.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-13T09:28:48-07:00"
    },
    {
      "id": "4608940821",
      "userName": "dertah6",
      "userUrl": "https://itunes.apple.com/us/reviews/id190781830",
      "version": "5.9",
      "score": 1,
      "title": "Sub-par first experience with this service",
      "text": "This is my first ever experience with Yoshi. \n\nI scheduled a gas delivery service from the app for 8/12/2019 between the hours of 9am to 1pm (they ask you to schedule a time slot of at least four hours. Understandable). On my \"Yoshi day\", I checked the app for any and all updates regarding the service.\n\nFirst problem: When I checked the app, it had said that the ETA would be between 4:08pm and 4:38pm, which was SEVERAL HOURS past the time slot I had originally signed up for. The reason why I signed up for a 9am-1pm slot is because I had other things to do in another city. Yoshi lets you change your parking location only within a certain radius of your originally-scheduled location. Anything outside of that specified radius, and you'll have to change your delivery time and/or date. At that point, it started to feel like they were expecting me to waste my entire day and wait around for them. Very unprofessional.\n\nSecond problem: Not only did they totally disregard my allotted time slot, but that ETA kept getting later and later as the day went on. By around 3pm, their ETA had updated to around 6:30pm at the latest. \n\nThird problem: One of Yoshi's customer service reps reached out to me via text at 5:14pm saying that they won't be able to get to my car due to delays, commented that they are working on adding more fuel tech to my area, added a $10 credit to my account thinking that would make up for the sub-par service I experienced, and then canceled my service for the day.\n\nI totally understand that delays happen. However, why was I contacted so late in the day? Yoshi's operating hours are from 9am to 5pm. They had PLENTY of time to let me know that they wouldn't be able to get to my car, and schedule me for another day. I would have been okay with AT LEAST that. Again, they contacted me at 5:14, which is after they have concluded operations for the day. That's totally unprofessional, and quite frankly, a bit disrespectful. \n\nI appreciate the credit added to my account, but that hardly makes up for what I have experienced today. I have scheduled yet another gas service for tomorrow. How that goes will determine whether or not I continue using this app. For now, I feel this 1-star review is very well-earned, and I can't say that I will be recommending this service to any of my friends or family.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-12T18:34:53-07:00"
    },
    {
      "id": "4608344032",
      "userName": "ddy edrix",
      "userUrl": "https://itunes.apple.com/us/reviews/id870220775",
      "version": "5.9",
      "score": 1,
      "title": "Very Unreliable",
      "text": "They ask for a time window of at least 4 hours when you set an appointment. They failed to fillup my car FOUR times in a row now and I’ve given them a window time of 6 hours everytime. Very unreliable company, they supposedly use mobil gas but sell it for 99c a gallon. You get what you pay for i guess.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-12T14:47:45-07:00"
    },
    {
      "id": "4593162710",
      "userName": "Deeeeeeeeenumber1",
      "userUrl": "https://itunes.apple.com/us/reviews/id85842234",
      "version": "5.9",
      "score": 3,
      "title": "Mixed feelings",
      "text": "I have mixed feelings about Yoshi. I have been using them for 3 months and although the delivery aspect of service is great, they have only been on time about 20% of the time. I fill up twice a week and on those days I’m literally waiting HOURS for my delivery. The most ridiculous one yet was last week. I was scheduled between 9-1pm, I get a text from Rachel @ 5:45pm!!!! You can’t be serious?! They really need to get this on track soon or I will cancel my membership and stop referring their business to my colleagues.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-09T15:56:49-07:00"
    },
    {
      "id": "4591956747",
      "userName": "Huezo04",
      "userUrl": "https://itunes.apple.com/us/reviews/id166765124",
      "version": "5.9",
      "score": 1,
      "title": "Good App Good Idea Bad Service",
      "text": "I planned to fill up my tank since Thursday, only to be canceled Friday when I needed my gas. Wouldn’t recommend.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-09T10:18:23-07:00"
    },
    {
      "id": "4591780251",
      "userName": "Yayiphones",
      "userUrl": "https://itunes.apple.com/us/reviews/id25128137",
      "version": "5.9",
      "score": 5,
      "title": "Love Yoshi!",
      "text": "I’ve been using Yoshi for 6 months now and I LOVE IT. It’s nice not having to worry about filling up my gas, especially on those days when I’m about to hit empty and don’t have time to go to the gas station. The app is straight forward and easy to use. They even have someone dedicated to sending you text reminders that Yoshi is on their way for your services or if you just have questions you can talk to them directly. They text you once the service is complete and email you a receipt right after. I also like that they’re good about the time frames you give them and are punctual.\n\nThe only thing I wish they had on the app was access to receipts/charges.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-09T09:33:16-07:00"
    },
    {
      "id": "4591568035",
      "userName": "Thauron",
      "userUrl": "https://itunes.apple.com/us/reviews/id87559727",
      "version": "5.9",
      "score": 5,
      "title": "One less thing to do",
      "text": "There are a lot of cars in my family, and it’s convenient for all of us to be together on Friday and have all our cars filled up while we catch up on the week =]",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-09T08:39:44-07:00"
    },
    {
      "id": "4588315750",
      "userName": "Rcblackjr",
      "userUrl": "https://itunes.apple.com/us/reviews/id157771895",
      "version": "5.8.1",
      "score": 1,
      "title": "My delivery was canceled.",
      "text": "So I finally decided to use the app because my trial period is almost up. I went on the app Wednesday during the day and scheduled a delivery for Thursday morning. Everything was confirmed and then the following day(morning of my delivery)I received an email and a txt saying their routes are full for the day and for me to reschedule. I sort of laughed when I saw this because I had a feeling something was going to happen. Anyways, I sent a txt message to the customer service number and she basically didn’t really help much other then telling me to reschedule for next week. I’m like but I need gas in my car before weekend. So frustrating and clearly they need to figure out scheduling, logistics, and the demand.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-08T16:40:55-07:00"
    },
    {
      "id": "4584073615",
      "userName": "Franklin Juice Co.",
      "userUrl": "https://itunes.apple.com/us/reviews/id209120305",
      "version": "5.8.1",
      "score": 5,
      "title": "Most Valuable App",
      "text": "Hands down, most valuable app!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-07T18:54:48-07:00"
    },
    {
      "id": "4582217072",
      "userName": "Desiilatice",
      "userUrl": "https://itunes.apple.com/us/reviews/id678060604",
      "version": "5.8.1",
      "score": 1,
      "title": "Horrible!!",
      "text": "I have tried multiple times to schedule an appointment and every time it is cancelled due to the driver not being able to make the time slot at the last minute. Now today as I have scheduled my delivery for the 4th time they have blocked me out of the application and will not answer any phone calls or questions after attempting to charge my credit card multiple times. Ridiculous!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-07T08:53:38-07:00"
    },
    {
      "id": "4578581981",
      "userName": "Incognito2019",
      "userUrl": "https://itunes.apple.com/us/reviews/id307566037",
      "version": "5.8.1",
      "score": 1,
      "title": "Terrible",
      "text": "Terrible! Just terrible! I’ve tried to schedule a gas fill up 3 times. Every attempt, on different days and time frames, has been a fail. Don’t even bothering with a “requested time window”... they never show up. \nCustomer service is equally as bad. \nDo not trust this company!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-06T13:46:12-07:00"
    },
    {
      "id": "4574465354",
      "userName": "Chanae aka frenchie (cpt)",
      "userUrl": "https://itunes.apple.com/us/reviews/id335519447",
      "version": "5.8.1",
      "score": 1,
      "title": "DONT DOWNLOAD BEWARE",
      "text": "TERRRRRIBLE SERVICE !!!!!!!!! \nDon’t download \n\nI set a time for 9-1pm on Thursday no show between time window \nSet it up again for FRIDAY ... SAME THING! \nIt’s Monday And I’m still waiting it’s 3pm\nETA ON THE APP is saying 3:50pm\nAnd by the way Rachel is very rude in text messages! \n\nLiterally they will waste your time !",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-05T14:25:17-07:00"
    },
    {
      "id": "4557499312",
      "userName": "Anythingclean",
      "userUrl": "https://itunes.apple.com/us/reviews/id407360527",
      "version": "5.8.1",
      "score": 1,
      "title": "Horrible time",
      "text": "They never come on time make sure you have nothing to do the day you need the gas",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-08-02T13:01:06-07:00"
    },
    {
      "id": "4545976722",
      "userName": "jeny sy",
      "userUrl": "https://itunes.apple.com/us/reviews/id104114398",
      "version": "5.8.1",
      "score": 5,
      "title": "So great!!",
      "text": "The simplicity of never having to worry about having to pump gas is great, especially with young kids. I never have to stress about going to gas stations or running out of gas! Plus my tech is super nice!!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-31T06:04:32-07:00"
    },
    {
      "id": "4538007262",
      "userName": "TNovitsky",
      "userUrl": "https://itunes.apple.com/us/reviews/id20701099",
      "version": "5.8.1",
      "score": 5,
      "title": "Great service all around",
      "text": "I’ve only been using the service for a few weeks but love it. The service is impeccable (somehow a promo wasn’t applied - not sure if I didn’t apply correctly or it was their error but they didn’t question - they just fixed it immediately). And they are super responsive if you have a question or a hiccup with your timing/car availability. The gas is cheaper than I find anywhere near me. I have yet to match, let alone beat their price near my workplace. It seems like a luxury but I find it alleviates some of the stress of the pre- or post-commute scramble. Highly recommend! And the app is clear, easy-to-use, and with the parking pin is just cool. I like the text/email reminders and confirmations of service. Just very well done.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-29T10:56:55-07:00"
    },
    {
      "id": "4512368514",
      "userName": "Sinner1119",
      "userUrl": "https://itunes.apple.com/us/reviews/id803099119",
      "version": "5.8.1",
      "score": 5,
      "title": "Best service",
      "text": "If you are busy at work and dnt get time to refuel your car just Call Yoshi.\n\nI am using Yoshi since 6 months and very happy with fuel price and there awesome service.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-24T16:16:21-07:00"
    },
    {
      "id": "4511136401",
      "userName": "nsb3",
      "userUrl": "https://itunes.apple.com/us/reviews/id87420619",
      "version": "5.8.1",
      "score": 1,
      "title": "Dont trust any representations they make.",
      "text": "From the first phone call when a sales rep began bugging the crap out of me over and over to ask if they could fill up either of my vehicles I said no but I wonder if you could fuel my boat. Then she asked where it was parked etc I said a slip. Then we talked about the hose lengths and I said well it wont reach my permanent slip spot but I can find a place to park for the fill up and she said that sounds great. We talked multiple times after that and I told her I hadnt found a spot yet. Then I found one and even mentioned it was a boat launch and that I would pay for their entry to the ramp they said great. I cleared my afternoon on Monday after waiting for a response by email they said they couldn’t make it. Then I cleared my work calendar again today for the whole day to accommodate then an hour before the window they tell me they cant do boats and have no way of telling me who bugged the crap out of me for the last 4 months! No thank you!!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-24T09:05:34-07:00"
    },
    {
      "id": "4501834462",
      "userName": "Gees01",
      "userUrl": "https://itunes.apple.com/us/reviews/id620594233",
      "version": "5.8.1",
      "score": 1,
      "title": "The app glitches",
      "text": "My son deleted my app and downloaded again and asking me for my number to\nLog in and input it and keeps telling me he send me a code but I have not received anything! The app needs some fixing to do... it also wouldn’t let me add a vehicle I would put the model and it wouldn’t search anything up\n\nUPDATE: I texted them and they responded with my account has been closed for fraudulent activity when I have only used the app once and my friends just my code this past week so now I have .50 cent gallon of gas but now it’s closed when I try to use to it but it wasn’t closed when my friends try to use the code🤔 This is a SCAM as soon as your first time is over you try getting gas cheap again they shut it down! I will be letting my friends know not to refer because they won’t be able to use it anyways!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-22T06:48:44-07:00"
    },
    {
      "id": "4494691811",
      "userName": "youknowyara",
      "userUrl": "https://itunes.apple.com/us/reviews/id726573991",
      "version": "5.8.1",
      "score": 5,
      "title": "Love it",
      "text": "As a woman, it’s nice to not go to the gas station. In my area it can be dangerous and I feel so good not having to deal with catcalling as I pump gas. Thank you!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-20T19:25:22-07:00"
    },
    {
      "id": "4476460918",
      "userName": "Coin coin coin coin",
      "userUrl": "https://itunes.apple.com/us/reviews/id49982331",
      "version": "5.8.1",
      "score": 2,
      "title": "Easy to scam, bad service",
      "text": "If you are referred than you get a 99¢ a gallon fillup, and for every person you refer you get a 50¢ a gallon fillup, so abuse this as much as possible. They are very poor with predicting times and being on time. you are forced to give them a 4 hour window and they still manage to miss that. If you want the 99¢ a gallon fillup feel free to use my code ’CALVINT0C5E’. Never pay the actual price or membership, just abuse for a month and delete the app. maybe 2 months if you can refer a lot of people",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-17T13:28:14-07:00"
    },
    {
      "id": "4467475261",
      "userName": "matthewn20",
      "userUrl": "https://itunes.apple.com/us/reviews/id351000585",
      "version": "5.8.1",
      "score": 1,
      "title": "DO NOT USE - SERVICES ARE A RIP-OFF",
      "text": "I just installed the app and thought it was like an Uber for gas, but they are ripping you off charging expensive amounts of services to get you a discount for gas. If you do not use the services they will only charge you for the gas, but then in a month they charge you delivery fees plus to fill-up gas. This app is SO DISORGANIZED which is so unacceptable for the company to do this. If you are reading this DO NOT install. You do not know exactly how many gallons you are filling up which can lead you to be overcharged. The company needs to do better. I would definitely give 0 stars if possible.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-15T17:19:22-07:00"
    },
    {
      "id": "4434387917",
      "userName": "ZarahD",
      "userUrl": "https://itunes.apple.com/us/reviews/id111231195",
      "version": "5.8.1",
      "score": 1,
      "title": "Poor customer service",
      "text": "The gas wasn't filled up all the way. Didn't offer resolution. Inconsistent service .",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-09T07:50:31-07:00"
    },
    {
      "id": "4420300527",
      "userName": "The White Donkey",
      "userUrl": "https://itunes.apple.com/us/reviews/id29344449",
      "version": "5.8.1",
      "score": 5,
      "title": "Great app and idea",
      "text": "Yoshi has been a great app. It takes a minor annoyance and makes it disappear.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-06T09:07:54-07:00"
    },
    {
      "id": "4419913489",
      "userName": "nakasf",
      "userUrl": "https://itunes.apple.com/us/reviews/id341748786",
      "version": "5.8.1",
      "score": 1,
      "title": "Review ONLY for a TERRIBLE CAR WASH.",
      "text": "First of all, the car wash price went from $35 to unreasonable $49. Car was dirty on the outside, and needed to be washed on !OUTSIDE ONLY! and they asked for more money saying that it took them more than usual 30 minutes, but on a app it’s saying to allow 1 hour! \nThe car is still DIRTY! Customer service never got back to me on this issue, paid $49 for nothing. I should have gone to real car wash for $37 they would leak my car clean inside and out at no additional charge",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-06T07:27:17-07:00"
    },
    {
      "id": "4417295125",
      "userName": "323eric",
      "userUrl": "https://itunes.apple.com/us/reviews/id396724237",
      "version": "5.8.1",
      "score": 1,
      "title": "Getting worse and worse",
      "text": "First of all this service is not 100% reliable which is the most important part if you’re paying $20 a month, the first time I scheduled they didn’t show up. Then they raise the prices on car washes and oil changes by a crazy amount not a reasonable $5 or $10 but $20+. Lastly THEY NO LONGER SERVICE MY AREA or any area around me. Instead of expanding they sent me an email saying they are removing several dozen zipcodes from their service area!!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-05T19:51:41-07:00"
    },
    {
      "id": "4414527442",
      "userName": "FootballFreak116",
      "userUrl": "https://itunes.apple.com/us/reviews/id14312943",
      "version": "5.8.1",
      "score": 5,
      "title": "Really awesome",
      "text": "The service is super convenient. I really do like it. Only drawback is that the price goes by the lowest in that specific zip code. I, personally, think they should go by lowest price in a several mine radius. More people would subscribe in that case. Then I could get gas at my home instead of my work, haha. \n\nAnyway, really awesome service and you give the window. Super convenient",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-07-05T06:29:32-07:00"
    },
    {
      "id": "4389160758",
      "userName": "Jezebel1957",
      "userUrl": "https://itunes.apple.com/us/reviews/id395270650",
      "version": "5.8.1",
      "score": 5,
      "title": "Roll On",
      "text": "I have always said, when you pay thousands of dollars for a vehicle, it should roll down the road without doing anything to it.  Yoshi makes me feel that I have my wish.  I don’t have to pump gas or sit while they change my oil.  I love Yoshi !!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-29T20:13:31-07:00"
    },
    {
      "id": "4383658496",
      "userName": "Sasha K T",
      "userUrl": "https://itunes.apple.com/us/reviews/id100207479",
      "version": "5.8.1",
      "score": 1,
      "title": "If only I could give 0 starts",
      "text": "The couple of month, pricey but great service. After that, terrible! I’ve been paying $20 a month for sometime now and for what? For them to cancel literally EVERYTIME. It’s not like I live in a remote area! I live in LA. BEWARE!!!!!!!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-28T18:44:08-07:00"
    },
    {
      "id": "4365239690",
      "userName": "DobleM_024",
      "userUrl": "https://itunes.apple.com/us/reviews/id949483619",
      "version": "5.8.1",
      "score": 1,
      "title": "unreliable",
      "text": "super unreliable",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-24T15:39:02-07:00"
    },
    {
      "id": "4362394272",
      "userName": "soon to be stranded",
      "userUrl": "https://itunes.apple.com/us/reviews/id425587315",
      "version": "5.8.1",
      "score": 1,
      "title": "No service anywhere",
      "text": "Entered 5 ( yes five! ) different addresses and all failed. No service area. I entered my work, my home, my parents home, and then just for giggles my old address in another city and then my address from another city. Nothing. Where do they service? Why did I get the ad then? I live in Fort Worth and I work near Dallas. My old address was in San Antonio. Not like I’m in small cities or towns. So.... what’s up!?",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-24T00:58:04-07:00"
    },
    {
      "id": "4345394609",
      "userName": "Courtesyy",
      "userUrl": "https://itunes.apple.com/us/reviews/id490628238",
      "version": "5.8.1",
      "score": 1,
      "title": "Worst decision",
      "text": "First week with this company went smooth but after that they didn’t show up 3 times straight times and didn’t send a text until the very last minute that they’re not coming. Had to plan my whole day around this and they let me down",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-20T18:08:53-07:00"
    },
    {
      "id": "4335773514",
      "userName": "ThisNicknameTaken7",
      "userUrl": "https://itunes.apple.com/us/reviews/id811159918",
      "version": "5.8.1",
      "score": 5,
      "title": "Yoshi is better than Uber! (& I love Uber!)",
      "text": "Never empty.  Never have to deal with gas stations.  Awesome service.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-18T13:01:53-07:00"
    },
    {
      "id": "4335458868",
      "userName": "ChanBengel",
      "userUrl": "https://itunes.apple.com/us/reviews/id323874603",
      "version": "5.8.1",
      "score": 5,
      "title": "Great service!",
      "text": "I’ve used this service for 3 weeks now and utilized fill ups, oil change, windshield cleaning and engine cleaner.  It’s been wonderful. The customer service staff is polite and quick, the app allows for all sorts of flexibility in terms of scheduling and I find the services end up costing not much more than having to run out to do them myself.  A great value!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-18T11:08:45-07:00"
    },
    {
      "id": "4335039757",
      "userName": "Klarasanfili 00000",
      "userUrl": "https://itunes.apple.com/us/reviews/id35086483",
      "version": "5.8.1",
      "score": 5,
      "title": "My wife and I love it",
      "text": "My wife and I despise getting gas for our cars, because the gas station is always the opposite direction of where we need to go and it always adds about 15 to 20 minutes extra. Yoshi always shows up when we need it. I wish the arrival windows were just a little bit tighter to predict the arrival, but they always come on time and are very quick. Also the car wash service is the best I’ve had done for the price. 👍👍",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-18T08:51:54-07:00"
    },
    {
      "id": "4315575075",
      "userName": "DuchessÇheeky",
      "userUrl": "https://itunes.apple.com/us/reviews/id125877933",
      "version": "5.8.1",
      "score": 5,
      "title": "Very Pleased",
      "text": "I was very skeptical at first. However they came, filled me up, sent text w/pic proof and a receipt. I’m totally sold. I will never go to a gas station again.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-14T10:58:22-07:00"
    },
    {
      "id": "4311063399",
      "userName": "Bunzglazer",
      "userUrl": "https://itunes.apple.com/us/reviews/id505051861",
      "version": "5.8.1",
      "score": 5,
      "title": "Really upset",
      "text": "Even though this app knows your out of their service range they will still charge you. I really wanted to try this app but it still charged me $9 for something I can’t use and I also got it because it said try it for free?",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-13T13:46:42-07:00"
    },
    {
      "id": "4310043821",
      "userName": "DesignsByBlake",
      "userUrl": "https://itunes.apple.com/us/reviews/id573922210",
      "version": "5.8.1",
      "score": 3,
      "title": "Too annoying to Use",
      "text": "Your on boarding is rage inducing. I downloaded the app, opened it to 3 permission modals that instantly triggered, before I could interact with them an animation popped on top of that with a rolling truck saying the app was downloading updates. The updates took longer than the initial download. Do your customers a favor and bundle that data into your core install. \n\nDuring the animation I get a text for a “CSR” to help me place an order. You haven’t even given me the chance to interact with your product yet! \n\nAfter the updates animation the permissions modals are nowhere to be found. Set up my car data, then look - more pop up offers. $20 off a subscription with a sign up button. $20 off what bass price, what are the terms, where can I find out more before opting in?\n\nMinimized the app the write this review, pulled it back up to clarify a few details and the bottom half of the screen is solid white and the content all scrolls behind it. \n\nYou guys need to work on your UX. \n\niPhone XR\niOS 12.3.1",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-13T08:36:22-07:00"
    },
    {
      "id": "4306460495",
      "userName": "Jayeebee",
      "userUrl": "https://itunes.apple.com/us/reviews/id15919435",
      "version": "5.8.1",
      "score": 5,
      "title": "Easy convenient",
      "text": "-App is awesome now that it is improved \n-Services offered are great \n-super convenient \n\nBeen using them for about 6 months and I am very happy with the company. They keep improving and they were pretty good to start with. The only thing I wish they had longer hours/weekends.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-12T15:27:52-07:00"
    },
    {
      "id": "4306275743",
      "userName": "Heyjge",
      "userUrl": "https://itunes.apple.com/us/reviews/id162125148",
      "version": "5.8.1",
      "score": 5,
      "title": "So easy and convenient",
      "text": "I was hesitant about signing up because I wasn’t sure it was worth it. Well 4 months in now I can say... it is! I never have to worry about getting gas and they price match the nearest gas stations. Love it so far.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-12T14:20:22-07:00"
    },
    {
      "id": "4306035733",
      "userName": "whydontyouwantmymomey",
      "userUrl": "https://itunes.apple.com/us/reviews/id609587088",
      "version": "5.8.1",
      "score": 1,
      "title": "Difficult to rate",
      "text": "It’s difficult for me to rate them for service when they keep avoiding me. I reschedule 2 times already and keep saying that they are backed up and the can’t service me in the 4hr window I gave them. But they only ask for a 4hr window so how is that my fault",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-12T12:57:36-07:00"
    },
    {
      "id": "4304428590",
      "userName": "cattyboh",
      "userUrl": "https://itunes.apple.com/us/reviews/id422732209",
      "version": "5.8.1",
      "score": 5,
      "title": "Awesome company",
      "text": "Love this service. They are great and save me a lot of time. Sooo easy to us and work with!!!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-12T05:58:41-07:00"
    },
    {
      "id": "4295329436",
      "userName": "Tarry Heal",
      "userUrl": "https://itunes.apple.com/us/reviews/id630151882",
      "version": "5.8",
      "score": 5,
      "title": "Yoshi simplifies my week",
      "text": "Especially now that Yoshi allows more flexibility in scheduling\nGreat for young moms who don’t want to lug their kids to the gas station",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-10T06:36:00-07:00"
    },
    {
      "id": "4279120028",
      "userName": "Prplesunshyn",
      "userUrl": "https://itunes.apple.com/us/reviews/id542077984",
      "version": "5.8",
      "score": 5,
      "title": "Best thing ever",
      "text": "I love this service. Specifically that I get a number I can get and receive text messages to. I don’t always have time to make a phone call, but with Yoshi, I can text. The app is super easy and user friendly. Absolutely love the service!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-07T11:19:04-07:00"
    },
    {
      "id": "4265555705",
      "userName": "michelleb20",
      "userUrl": "https://itunes.apple.com/us/reviews/id108690689",
      "version": "5.8",
      "score": 5,
      "title": "Highly recommend!",
      "text": "So convenient and so simple! I was just planning on using the free first month but after such an amazing experience I am for sure planning on continuing to use it! Makes life so easy for oil changes and car washes!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-04T20:42:54-07:00"
    },
    {
      "id": "4253218937",
      "userName": "acchea",
      "userUrl": "https://itunes.apple.com/us/reviews/id42878587",
      "version": "5.7",
      "score": 3,
      "title": "You pay more but it's convenient",
      "text": "Let's say you fill up your tank once a week. Let's say your car takes 11 gallons per weekly fill up. Let's say gas is $2.85 a gallon. If you fill up at a gas station, you would pay $31.35. If you use Yoshi, it will cost you about $29.15 at the discounted rate they offer, plus $4 from the monthly rate, you pay $33.15. Now let's say you fill up every two weeks and your car holds 20 gallons. At $2.85 a gallon, it would cost you $57. With Yoshi, it would cost $61. If you're a weekly filler, that's about $100 a year. If you're a biweekly filler, it's $104. Now if you're like me and you have a motorcycle that needs to be filled up every 2 days, that's an extra $100 a year. You’re paying at least $100 a year for something you can do yourself. But you are paying for convenience. If you use this product and are happy with it, it’s definitely worth it. If you live half a mile from the gas station like me, maybe not.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-06-02T11:57:57-07:00"
    },
    {
      "id": "4231863431",
      "userName": "Christiano Kiarash",
      "userUrl": "https://itunes.apple.com/us/reviews/id863265021",
      "version": "5.7",
      "score": 1,
      "title": "Scam! not Useful at all",
      "text": "I downloaded the yoshi and requested for the gas.\nThey didn’t show up and wasted my time since i tried to put a little bit gas instead of full tank since I thought they will show up.\nTheir customer service also are automated system or they copy and paste one answer over and over.\n\nThe worst app that I downloaded from apple store. Not sure apple store trusted Yoshi.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-05-29T14:24:01-07:00"
    },
    {
      "id": "4231541229",
      "userName": "Shiva_C",
      "userUrl": "https://itunes.apple.com/us/reviews/id289911941",
      "version": "5.7",
      "score": 1,
      "title": "No technicians",
      "text": "Yoshi don’t have technicians to cover some areas but they scheduled for gas gilling 2 times in last week but unable to fill up gas due to unavailability of technicians in area.\nThey knew they don’t have technicians upfront but they still scheduled it(which is annoying) but unable to perform the services.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-05-29T12:41:20-07:00"
    },
    {
      "id": "4226096233",
      "userName": "Johan_agsa",
      "userUrl": "https://itunes.apple.com/us/reviews/id307571366",
      "version": "5.7",
      "score": 1,
      "title": "Don’t waste your time",
      "text": "You can always get money back but the time I lost believing in this company will never come back. I scheduled my first order since they promised 99 cents per gallon (how can you refuse?) so I requested for them to be here in the morning (9 am to 1 pm). Being this said I stayed at home the whole time and the truck came near my house but never filled up my car’s tank and left. Now I contact customer service (“Rachel”) and she says that the car has been filled up using the 99 cents promo on another account so this fill up will be full price and I don’t even have another freaking account! So basically they’re saying I’m crazy. They play with your time, your money and your sanity.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-05-28T10:09:37-07:00"
    },
    {
      "id": "4204067181",
      "userName": "RS Felix",
      "userUrl": "https://itunes.apple.com/us/reviews/id709031805",
      "version": "5.7",
      "score": 5,
      "title": "Perfect fuel service",
      "text": "I have Norman fuel my truck! Great time safer! Keep on growing. Rachel, the operator is super responsive and turns questions super fast!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-05-24T17:37:58-07:00"
    },
    {
      "id": "4164608343",
      "userName": "deisel98",
      "userUrl": "https://itunes.apple.com/us/reviews/id107505459",
      "version": "5.7",
      "score": 5,
      "title": "Yoshi",
      "text": "I love Yoshi because it takes the hassle away from visiting a gas station and have the gas station visit you it’s even more convenience for women who don’t like to pull in a gas station to pump gas !!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-05-17T06:06:48-07:00"
    },
    {
      "id": "4149844266",
      "userName": "slwcrord",
      "userUrl": "https://itunes.apple.com/us/reviews/id767595998",
      "version": "5.6",
      "score": 2,
      "title": "Disappointed",
      "text": "I’ve been using this app for quite some time it was great until I started to give out my referral code to my family so they could enjoy the app service as well. Once I gave it to my brother and he put his car in (mind you we have the same car just different plates) I get a message saying that my account has been closed due to fraudulent activity. I then go to customer service which is only available through text message and ask them if they can give me a reason why my account has been closed and also my brothers no reply. How are they going to blame me of fraudulent activity if they don’t even have their facts straight and the fact that customer service is a complete disaster with Rachel. I need to talk to someone instead of this little kid stuff which I can only text customer service.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-05-14T10:27:13-07:00"
    },
    {
      "id": "4141044529",
      "userName": "Gabrieloleas",
      "userUrl": "https://itunes.apple.com/us/reviews/id42156696",
      "version": "5.6",
      "score": 5,
      "title": "Great customer service",
      "text": "USE MY CODE FOR FREE GAS: GABRIELO6CE6\n\nI am very satisfied. This was my first time using yoshi and the process was incredibly smooth. Gas prices around me was 2.80 and they charged me 2.63$. Incredibly convenient to schedule weekly gas top offs to never have to worry about gas again. They also offer oil changes, car washes, etc. Etc. I used my friends code for 99 cents per gallon on your first fill up, and you could use mine as well! Mine is GABRIELO6CE6. 100% would recommend.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-05-12T14:46:18-07:00"
    },
    {
      "id": "4120910145",
      "userName": "Swolfgazo",
      "userUrl": "https://itunes.apple.com/us/reviews/id241294296",
      "version": "5.6",
      "score": 5,
      "title": "No more waiting at the gas pump!",
      "text": "For someone who has a busy life like myself, you save 30-60 mins of you life a week by allowing someone else to pump up you gas. Prices are reasonable, and they communicate via text. Love using them!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-05-08T15:46:58-07:00"
    },
    {
      "id": "4113825450",
      "userName": "FarmDog69",
      "userUrl": "https://itunes.apple.com/us/reviews/id123606272",
      "version": "5.6",
      "score": 5,
      "title": "It’s awesome.",
      "text": "The service and the app are awesome. I’ve used Yoshi many times now, and it’s always a great experience. It sounds too good to be true, but it’s the real deal. I’m telling my co-workers about it and they’re using it, too.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-05-07T05:54:03-07:00"
    },
    {
      "id": "4096842014",
      "userName": "Vitalia Suns",
      "userUrl": "https://itunes.apple.com/us/reviews/id673493982",
      "version": "5.6",
      "score": 5,
      "title": "Awesome Service",
      "text": "First time customer of YOSHI & must say I live everything about these guys. They were 45 min out of the service window but I won’t be too critical on that at the moment. If you can’t get an appointment for an oil service with YOSHI stop by Havoline Xpress @ 1953 Howell Mill Rd & I will be sure to take care of you. \nThanks YOSHI for the great service.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-05-03T18:35:42-07:00"
    },
    {
      "id": "4051746632",
      "userName": "Bunkogal",
      "userUrl": "https://itunes.apple.com/us/reviews/id277766889",
      "version": "5.5",
      "score": 5,
      "title": "Wonderful service in many ways.",
      "text": "I never liked pumping gas, especially living in Boston for 20 years. Yoshi services me at work and at home.  How convenient that they changed my oil and I never had to wait in a public lobby.  They offer great specials too! YOSHI is my new BFF!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-23T15:43:36-07:00"
    },
    {
      "id": "4046319134",
      "userName": "Sheyllah Ehlert",
      "userUrl": "https://itunes.apple.com/us/reviews/id487395647",
      "version": "5.5",
      "score": 5,
      "title": "Outstanding service!!",
      "text": "This is from far one of the most outstanding services i have ever used. Help is there all the way anytime you need it. The person shows up every single time and fills up the tank and i dont have to take the extra time to go to the gas station nor to put the extra miles for it. Its simply amazing and a tremendous help for anybody with a busy agenda. Highly recommended!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-22T07:52:22-07:00"
    },
    {
      "id": "4016963171",
      "userName": "DeafGentleKing",
      "userUrl": "https://itunes.apple.com/us/reviews/id109546601",
      "version": "5.5",
      "score": 1,
      "title": "Time?",
      "text": "I agreed with another reviewers that rant this lazy service.   I scheduled ahead by 2 weeks only to find my car not even filled.   I had to fill my car myself and called service that never come.   I m cancelling this.   I m sorry but you need to be on time or at least be nice to not reschedule without our permissions first.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-15T11:16:55-07:00"
    },
    {
      "id": "4000639236",
      "userName": "thesmashley",
      "userUrl": "https://itunes.apple.com/us/reviews/id213349783",
      "version": "5.5",
      "score": 5,
      "title": "YOSHI 😍😍😍",
      "text": "Yoshi is the best thing!  I love not having to stop for gas with my busy schedule!  The customer service absolutely amazing.  They work around your schedule anytime! Very friendly service and so convenient.  I highly recommend!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-11T17:17:19-07:00"
    },
    {
      "id": "3996546821",
      "userName": "butterbekers",
      "userUrl": "https://itunes.apple.com/us/reviews/id731631153",
      "version": "5.4.1",
      "score": 5,
      "title": "AMAZING",
      "text": "Simple, easy to use app. Friendly service, flexible scheduling, very informative app, they indeed do have the cheapest gas price, professional and clean! Very pleased and happy. Life changer.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-10T18:02:36-07:00"
    },
    {
      "id": "3996148116",
      "userName": "Justin - Student",
      "userUrl": "https://itunes.apple.com/us/reviews/id165383265",
      "version": "5.4.1",
      "score": 1,
      "title": "Constant sales calls",
      "text": "Do NOT download this app. They call, text, email, and harass you constantly. I regret downloading it. Not even close to worth it.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-10T15:23:37-07:00"
    },
    {
      "id": "3995776774",
      "userName": "MSP-Hospitality",
      "userUrl": "https://itunes.apple.com/us/reviews/id262612302",
      "version": "5.4.1",
      "score": 5,
      "title": "New Market, New Service",
      "text": "I office near MSP and was so excited when I saw this service!  The personalized service I have received from Rachel and other Yoshi members has been top notch!  I didn’t have to stand outside in a Blizzard to fuel my car.  Worth every penny to me!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-10T12:50:04-07:00"
    },
    {
      "id": "3995427430",
      "userName": "BLDAC",
      "userUrl": "https://itunes.apple.com/us/reviews/id347844757",
      "version": "5.4.1",
      "score": 5,
      "title": "Great People",
      "text": "I have worked in customer service my entire professional career and I don’t think I have found a better company to deal with. I always say people will buy from people not a business and Rachel and her team have always been very accommodating and professional with all of our needs. They are always prompt and continue to follow up multiple times a day. I would recommend Rachel and her team to anyone and as always I appreciate not having to ever worry when my next Yoshi day is!!! Thank you so much for all you do!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-10T10:35:55-07:00"
    },
    {
      "id": "3995422769",
      "userName": "Disappointed 20111",
      "userUrl": "https://itunes.apple.com/us/reviews/id145105497",
      "version": "5.4.1",
      "score": 5,
      "title": "Gas Service",
      "text": "First time customer! Super easy, seamless and very convenient.  I will be using this service moving forward!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-10T10:34:19-07:00"
    },
    {
      "id": "3995252810",
      "userName": "Laineshots",
      "userUrl": "https://itunes.apple.com/us/reviews/id138562863",
      "version": "5.4.1",
      "score": 5,
      "title": "Stellar Customer Service!",
      "text": "I’ve been using Yoshi service for almost a year now, and I’ve always been delighted with them. Rachel is unfailingly efficient and cheerful, and she gets things done! We got a Yoshi visit two days ago; yesterday we  realized only 1/4 tank had been pumped. I texted Rachel, who always makes me feel like we’re on the same team. With apologies, she immediately set me up with another visit today. Now my car is reassuringly full, as well as clean, and I still think Yoshi rocks! I’ve got some health challenges that make it impossible for me to take care of the routine things a car needs. Yoshi does them all for me, at a reasonable price and at convenient times. I don’t know what I’d do without this team!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-10T09:35:14-07:00"
    },
    {
      "id": "3991391157",
      "userName": "djwood36",
      "userUrl": "https://itunes.apple.com/us/reviews/id443175758",
      "version": "5.4.1",
      "score": 5,
      "title": "💯",
      "text": "The BEST! I never need to leave home for gas or service again. They come to my home! The follow up of their customer service is excellent. Texts and email reminders are sent in advance, and after service is complete. I tried another service first but it was inconvenient to travel to them at designated times. Yoshi is my new best friend.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-09T10:33:05-07:00"
    },
    {
      "id": "3986998153",
      "userName": "Paulmckuk2",
      "userUrl": "https://itunes.apple.com/us/reviews/id119550605",
      "version": "5.4.1",
      "score": 5,
      "title": "As good as it gets",
      "text": "This is an amazing service. Easy on time saves you money. Why would you pay more and waste your valuable time when a genius came up with such a simple service. Courteous staff. \nThank you Yoshi. My family thanks you too.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-08T07:58:58-07:00"
    },
    {
      "id": "3986842672",
      "userName": "In God I Trust!",
      "userUrl": "https://itunes.apple.com/us/reviews/id562385254",
      "version": "5.4.1",
      "score": 5,
      "title": "Game changer!",
      "text": "The flexibility of Yoshi is top notch. I can request a change to my delivery day on the same day, before the route starts and they ALWAYS fit me in.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-08T07:12:02-07:00"
    },
    {
      "id": "3965236049",
      "userName": "yousef oqa",
      "userUrl": "https://itunes.apple.com/us/reviews/id950857952",
      "version": "5.4",
      "score": 1,
      "title": "Scam",
      "text": "I got called by one of the employees and they said they would give me a 20 dollar credit off my fill up but they only took of 10 they lie to you so you can use their service.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-03T11:18:41-07:00"
    },
    {
      "id": "3964586364",
      "userName": "sarahshust",
      "userUrl": "https://itunes.apple.com/us/reviews/id39244577",
      "version": "5.4",
      "score": 5,
      "title": "BEST MOBILE SERVICE",
      "text": "We’ve been using Yoshi for several months and have been VERY HAPPY! Scheduling has been very easy, communication has Never been an issue, and the technician is so kind and thorough. One time I had an issue with timing because my special needs kiddo needed a little more attention at drop off in the morning at school, I was desperate for a fill up and was stressed about missing the service, so I texted Rachel (the switchboard operator) and told her the situation. When I pulled down my street there was Yoshi waiting for me by my driveway. At risk of sounding a little dramatic, it has been such a game changer to not have to worry about keeping my car filled up. It’s one less thing and I’m so so grateful! Thank you, Yoshi! I’m a lifer!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-03T07:50:36-07:00"
    },
    {
      "id": "3961425297",
      "userName": "Frustrated customwr",
      "userUrl": "https://itunes.apple.com/us/reviews/id312944526",
      "version": "5.4",
      "score": 5,
      "title": "Great service and car wash!! Thanks!!",
      "text": "I've been using the service for a couple of months now. I love it!  So convenient and my customer service rep Rachel is so responsive and helpful.  Today I had a car wash and Bobby of Bobby Shine Shop that came was so nice and did an awesome job. \n\nDefinitely recommend and I do often.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-02T14:16:20-07:00"
    },
    {
      "id": "3961181981",
      "userName": "Might be Musically curious",
      "userUrl": "https://itunes.apple.com/us/reviews/id37686493",
      "version": "5.4",
      "score": 1,
      "title": "Be Careful Before You Download!",
      "text": "Be careful to download. I just wanted to look through the app and what it had to offer. I realized it was not for me and deleted the app. That should have been the end of it... Next thing you know I start getting emails. I unsubscribe. Then I start getting texts to start services. I asked them to please stop contacting me and remove me as a potential client. Next thing I know they are calling and leaving voice mails. The persistent badgering will not stop! Please do not download this App if you don’t want to commit to being pestered.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-02T12:44:49-07:00"
    },
    {
      "id": "3959344369",
      "userName": "medicstarr",
      "userUrl": "https://itunes.apple.com/us/reviews/id42699621",
      "version": "5.4",
      "score": 3,
      "title": "Good idea",
      "text": "Good idea if it was available in my area. Before having to go through all the hassle of signing up and asking for my instant how about first you letting me know if it’s available in my area",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-04-02T03:18:26-07:00"
    },
    {
      "id": "3952923687",
      "userName": "IAMNAYT",
      "userUrl": "https://itunes.apple.com/us/reviews/id182540379",
      "version": "5.4",
      "score": 5,
      "title": "Fantastic service, nice to not worry!",
      "text": "Been loving yoshi for 2 years and they just keep getting better!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-31T13:28:56-07:00"
    },
    {
      "id": "3943020706",
      "userName": "SQLServerCowboy",
      "userUrl": "https://itunes.apple.com/us/reviews/id372914159",
      "version": "5.4",
      "score": 5,
      "title": "The best thing Ever! Vehicle Services as a Service",
      "text": "Howdy! \n\nI was browsing through the AppStore for convenience services that enabled gas fill ups and car washes. \n\nThen I stumbled upon Yoshi! \n\nThe customer service rep was patient from the very start. \n\nAnswered all my questions and concerns. \n\nGot my first Gas fill up last week and was amazed with the gas mileage. \n\nGot mine done this week. Painless as ever. \n\nI highly recommend the service!! Never disappointed and the app does a fantastic job of keeping you posted. \n\nLove love love the service!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-29T13:06:20-07:00"
    },
    {
      "id": "3942830414",
      "userName": "Saj077",
      "userUrl": "https://itunes.apple.com/us/reviews/id503951446",
      "version": "5.4",
      "score": 5,
      "title": "Awesome service!",
      "text": "Yoshi is great... not only is it so convenient to skip a trip to the gas station every week (I’m going to get so spoiled!), they’re also excellent communicators. They tell you when they’re on their way. They let you change the service date to the day of! And when they get there, they’ll confirm via text that it’s your car if you, like me, hadn’t uploaded the VIN or tag yet. They’re super pleasant and fun; we even sent emojis lol. They’re also very responsive. They even took a photo of my car for the app. Couldn’t ask for more!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-29T12:00:25-07:00"
    },
    {
      "id": "3942261328",
      "userName": "DDR0011",
      "userUrl": "https://itunes.apple.com/us/reviews/id318343291",
      "version": "5.4",
      "score": 5,
      "title": "Yoshi saves time & is super convenient",
      "text": "Rachel, the customer service rep goes above and beyond to make sure you are informed about the time of service and provides all the follow up information (picture & amount of gas). The redesigned app has a great user interface and is easy to navigate. Yoshi gets a 5 star review for saving me time & money when it comes to getting gas!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-29T09:05:41-07:00"
    },
    {
      "id": "3941079105",
      "userName": "dkmorganjr",
      "userUrl": "https://itunes.apple.com/us/reviews/id24309224",
      "version": "5.4",
      "score": 5,
      "title": "What is your time worth?",
      "text": "Yoshi is an amazing service and I have been using it for years. Who wants to waste time in the cold or hot pumping gas weekly?  The staff are always available and willing to help with scheduling conflicts. I would highly recommend this service.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-29T04:29:14-07:00"
    },
    {
      "id": "3938047696",
      "userName": "paulski9er",
      "userUrl": "https://itunes.apple.com/us/reviews/id679071735",
      "version": "5.3",
      "score": 5,
      "title": "Awesome Service!",
      "text": "Yoshi is awesome! Ran out of gas rolling into work, and they came and filled me up quickly! Rachael was such a great person to work with too. I highly highly recommend Yoshi!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-28T11:37:53-07:00"
    },
    {
      "id": "3934412560",
      "userName": "RDC JR",
      "userUrl": "https://itunes.apple.com/us/reviews/id87350982",
      "version": "5.3",
      "score": 5,
      "title": "Breathe Cleaner",
      "text": "The service I receive from Yoshi is life changing, literally. I no longer breath the fumes from gas stations. I’d give it at least a 5+ year adder to my life. If that doesn’t get you going, I’m not sure what would. I’m hooked for (longer-lived) life!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-27T14:31:05-07:00"
    },
    {
      "id": "3934332011",
      "userName": "Adkins123456",
      "userUrl": "https://itunes.apple.com/us/reviews/id293251319",
      "version": "5.3",
      "score": 5,
      "title": "Love it!",
      "text": "The app is so easy to use. I love that I can track the truck so I can know when to except yoshi! My favorite part about this service is convenience and it’s super easy to schedule or change your delivery. Thanks for making this awesome service!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-27T13:56:35-07:00"
    },
    {
      "id": "3934259439",
      "userName": "Meech Uri",
      "userUrl": "https://itunes.apple.com/us/reviews/id743327253",
      "version": "5.3",
      "score": 5,
      "title": "Yoshi is the best!",
      "text": "Yoshi has the best service! Best text communication! I'm a busy working Mom and sometimes I forget (yes it happens) to put gas in my car. Yoshi has saved the day for me. Their customer is excellent and they are fast and reliable. They come my office to fill my tank up and I even got a few of my co workers to use them and they love the service. I 100% recommend Yoshi!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-27T13:25:42-07:00"
    },
    {
      "id": "3933692483",
      "userName": "Leon68",
      "userUrl": "https://itunes.apple.com/us/reviews/id28840491",
      "version": "5.3",
      "score": 5,
      "title": "Great service so far",
      "text": "I’ve only had the service for a short time, but it’s been working very well so far.  The customer service person in my area is excellent.  She is very responsive and has already shown great flexibility when I’ve move my appointment days and parking locations.  Just today, screwed up by leaving my gas flap locked.  She had the service rep wait for me to walk to my car to unlock it.  When I arrived, the rep was very patient and gently explained the locking feature of the gas flap that I didn’t even know about (I thought the flap did not lock but it does when I lock the car- who knew?). They could have canceled my service for today but they hung in there with me.  I’m enjoying the fueling service and look forward to trying out more services stating next week (car wash probably).",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-27T09:45:11-07:00"
    },
    {
      "id": "3931409960",
      "userName": "threeoneanddone",
      "userUrl": "https://itunes.apple.com/us/reviews/id37786632",
      "version": "5.3",
      "score": 3,
      "title": "Great concept, disappointing app",
      "text": "It’s next to impossible to figure out how to change location, for starters. Several other glitches that have convinced me they’re not quite ready for prime time. I don’t hate pumping gas enough to put up with the frustration of the app.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-26T20:18:05-07:00"
    },
    {
      "id": "3930946374",
      "userName": "GeriC12345",
      "userUrl": "https://itunes.apple.com/us/reviews/id106879246",
      "version": "5.3",
      "score": 5,
      "title": "Life changing!",
      "text": "I’m blown away by this company.  Super smart team really changing the industry.  I hate filling up my car.  The one gas station I used to go to would sometimes have a nozzle that jumped out, and once it spilled fuel all over my hands and outfit and I didn’t have time to go home and change.  For a very low membership fee, I can have on demand gas fuel ups and oil change and car wash at my home! Genius! Exceptional communication with the app too and customer support.  I want to tell the world about this company.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-26T17:17:47-07:00"
    },
    {
      "id": "3930938554",
      "userName": "daveraleigh",
      "userUrl": "https://itunes.apple.com/us/reviews/id37119443",
      "version": "5.3",
      "score": 1,
      "title": "Calling?",
      "text": "Not cool to receive random call from Yoshi rep to “assist in setting up first appointment.”",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-26T17:14:43-07:00"
    },
    {
      "id": "3913274660",
      "userName": "Latte22",
      "userUrl": "https://itunes.apple.com/us/reviews/id205806304",
      "version": "5.3",
      "score": 1,
      "title": "Waste of time! Don’t recommend!",
      "text": "I literally watched just the Yoshi truck pull up to try to open my gas cap and when he couldn’t he just drove away.  HE DID NOT EVEN TRY TO TEXT/CALL ME OR DID NOT NOTIFY ME THAT THEY WERE ON THE WAY LIKE THEY SAID THEY WOULD!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-22T12:15:04-07:00"
    },
    {
      "id": "3909540179",
      "userName": "Austin11456",
      "userUrl": "https://itunes.apple.com/us/reviews/id804571548",
      "version": "5.3",
      "score": 1,
      "title": "Really bummed about this app",
      "text": "I scheduled an appointment for an oil change two days before I was driving 300 miles down south. I was all excited because this honestly makes my life so much easier. I scheduled on Wednesday from 9 am to 1 pm but didn’t get any notification about my car being done. When I looked on the app it rescheduled me for the following week. I woke up the next day and got a text at 4 am telling me my service was cancelled because they couldn’t find my car. If they couldn’t find my car, why was I not called? My car was right in front of them, I parked it right outside my place. They have my number for a reason. I tried to get it rescheduled but everything was booked so instead I ended up just getting my tank filled up and now about to drive to Jifffy Lube to get an oil change. The fact that I wasn’t notified until the next day and that they weren’t able to give me a new appointment because they were too lazy to call, really makes me upset with this service. I cancelled my membership. It’s a great idea but they need to be on top of things more. Clearly I’m not the only one who has dealt with this after reading these reviews.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-21T14:58:47-07:00"
    },
    {
      "id": "3905394653",
      "userName": "RafySoto",
      "userUrl": "https://itunes.apple.com/us/reviews/id3643224",
      "version": "5.3",
      "score": 1,
      "title": "Horrible - skip",
      "text": "As an early adopter I like trying new services. They didn’t show up for today’s appointment and sent a text message indicating they are full for the day after having me confirmed. They are just not dependable. This was my second attempt. Not worth considering.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-20T14:25:00-07:00"
    },
    {
      "id": "3889295887",
      "userName": "thatdangkid8",
      "userUrl": "https://itunes.apple.com/us/reviews/id764585719",
      "version": "5.3",
      "score": 1,
      "title": "Thinking about it....but then...",
      "text": "I looked at the last 10 posts on this app to see what a turnover ratio would be out of 50 stars with 33 with star marks. It scares me the fact that it’s a 66% rate and looking on the service, this app sounds like a pump and dump, that is what AAA is for, the fact our generation is moving towards a bulk membership services is only going to create a bigger debt ratio economically. Think about it for each layer In the industry who switches to memberships lolz. Welcome to America where spending is a real problem.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-16T11:15:31-07:00"
    },
    {
      "id": "3881527122",
      "userName": "Saltaite1",
      "userUrl": "https://itunes.apple.com/us/reviews/id258336166",
      "version": "5.3",
      "score": 1,
      "title": "Stay away",
      "text": "20$ monthly fee, so complicated to cancel.\nGood idea, but need to be fixed some details.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-14T13:34:23-07:00"
    },
    {
      "id": "3872812035",
      "userName": "Llwilson22",
      "userUrl": "https://itunes.apple.com/us/reviews/id113954915",
      "version": "5.2.1",
      "score": 2,
      "title": "Lots of problems",
      "text": "I loved the idea of having these services brought to my doorstep but alas too good to be true.  The arrival window is too large which keeps you tied to the house waiting on gas.  Also scheduled services twice for a car wash.  Both times I paid 35 bucks for a car was which was only half done.  They didn’t touch the inside of the vehicle not a crumb or floor mat was vacuumed.  It’s was pretty annoying considering my local car wash does a decent  car wash for the same price. Unfortunately I couldn’t get close to a decent car was with Yoshi.  Too good to be true.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-12T05:07:09-07:00"
    },
    {
      "id": "3870579550",
      "userName": "Jake Wallace",
      "userUrl": "https://itunes.apple.com/us/reviews/id41073457",
      "version": "5.2.1",
      "score": 5,
      "title": "Excellent Service",
      "text": "Yoshi has come a long way from what it was only a few years ago. The app is very intuitive and scheduling or delaying fill ups is extremely simple. Offering oil changes, carwashes and other maintenance items has made my life much easier. Highly recommend getting this service!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-11T13:35:41-07:00"
    },
    {
      "id": "3854846699",
      "userName": "BarnaP",
      "userUrl": "https://itunes.apple.com/us/reviews/id43084356",
      "version": "5.2.1",
      "score": 1,
      "title": "Misused my data",
      "text": "Just got a marketing call from these people. I downloaded the app then deleted immediately because I didn’t want to use the service. \n\nOne star for misusing my data.  Zero stars if I could.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-07T17:10:31-07:00"
    },
    {
      "id": "3847308038",
      "userName": "OnoMommy",
      "userUrl": "https://itunes.apple.com/us/reviews/id12866991",
      "version": "5.2.1",
      "score": 5,
      "title": "Just a Mom",
      "text": "This service is fantastic. They’ve been very eagerly working to get my business. Listening to my concerns, and addressing them, so I tried them out. First fill up, fantastic! Looking forward to trying them again.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-05T16:49:35-07:00"
    },
    {
      "id": "3834919473",
      "userName": "Conner9802",
      "userUrl": "https://itunes.apple.com/us/reviews/id138367133",
      "version": "5.2",
      "score": 1,
      "title": "Diesel!!!",
      "text": "No diesel available. Kinda makes this app useless for some people with diesel cars and trucks.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-03-02T17:15:14-07:00"
    },
    {
      "id": "3762773359",
      "userName": "lovejc24",
      "userUrl": "https://itunes.apple.com/us/reviews/id238958813",
      "version": "5.0",
      "score": 1,
      "title": "App no good",
      "text": "Who ever is on the reviews pretending the service is great they are lying, you are charged 20$/month plus how ever much it cost your gas tank to be filled up. Don’t use this app it’s a scam",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-02-12T13:05:44-07:00"
    },
    {
      "id": "3762061903",
      "userName": "China20022",
      "userUrl": "https://itunes.apple.com/us/reviews/id103859876",
      "version": "5.0",
      "score": 5,
      "title": "Great Service!",
      "text": "I’ve been using Yoshi for a couple of months and have had an exceptional experience with both the service and support. We live in an area with crime at the gas stations so it’s so nice to know I get to stay home and have my gas delivered. I find if I need to reschedule they always make it very easy. I leave my car in the garage and open the gas cap for the delivery truck- it’s a simple as that.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-02-12T08:01:35-07:00"
    },
    {
      "id": "3740860717",
      "userName": "brighteyes20",
      "userUrl": "https://itunes.apple.com/us/reviews/id975004711",
      "version": "5.0",
      "score": 2,
      "title": "Like the service but bad customer service",
      "text": "Wait until they ask for membership and still have to pay out more",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-02-06T13:51:48-07:00"
    },
    {
      "id": "3738034975",
      "userName": "GreenCav Nashville",
      "userUrl": "https://itunes.apple.com/us/reviews/id133499062",
      "version": "5.0",
      "score": 5,
      "title": "YOSHI saves us time and money!",
      "text": "Love the new Yoshi app! The scheduled arrival time window is excellent - and if we need to change, we text Rachel who takes care of everything. We fill up our sports car and SUV weekly. \n\nLove the new price shopping match. We cancelled Costco because Yoshi is so easy and competitively priced. \n\nWant to try the tire pressure, car wash, and new blade services. Thank you Nashville Team Yoshi #KeepMoving",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-02-05T19:16:07-07:00"
    },
    {
      "id": "3682145809",
      "userName": "Willy Chase",
      "userUrl": "https://itunes.apple.com/us/reviews/id161148793",
      "version": "v4.12",
      "score": 5,
      "title": "Game changer",
      "text": "Life is remarkably easier and more efficient due to using YOSHI.  The support and customer service is outstanding.  The service techs are friendly and patient (especially when forgetting to leave a gas flap open or leaving a car locked on accident).  Love this concept.  Keep movin!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-01-22T08:59:59-07:00"
    },
    {
      "id": "3681755648",
      "userName": "damnlilt",
      "userUrl": "https://itunes.apple.com/us/reviews/id570635748",
      "version": "v4.12",
      "score": 1,
      "title": "Ripoff",
      "text": "You will pay for delivery and for your gas might as well go to the store",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-01-22T06:51:52-07:00"
    },
    {
      "id": "3662175878",
      "userName": "bill nye the science geek",
      "userUrl": "https://itunes.apple.com/us/reviews/id896383065",
      "version": "v4.12",
      "score": 1,
      "title": "3 trees? Really?",
      "text": "Co2 emissions do not kill trees. Trees actually believe it or not feed on carbon dioxide (co2) combining it with water to create sugar and releasing oxygen back into the atmosphere. This is something I learned in 6th grade science. If you are going to make a claim please back it up with a little research of your own.\n     Sources: scholastic 6th grade science book, chapter on Photosynthesis.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-01-17T15:48:45-07:00"
    },
    {
      "id": "3626648392",
      "userName": "MikeyMcGyver",
      "userUrl": "https://itunes.apple.com/us/reviews/id111127709",
      "version": "v4.12",
      "score": 3,
      "title": "Good but not great",
      "text": "I do absolutely love the convenience of always having a full tank seeing as how gas is delivered the same time each week.\n\nI only wish that the pay by delivery option was a thing.  I don’t always need to have 3-4 gallons delivered to top off my tank as my car is pretty fuel efficient and I don’t always need a fill up.  Or maybe a 10 dollar a month option for those who need a fill up once every two weeks instead of weekly.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-01-08T06:45:09-07:00"
    },
    {
      "id": "3607847621",
      "userName": "brew1forme",
      "userUrl": "https://itunes.apple.com/us/reviews/id49590515",
      "version": "v4.12",
      "score": 1,
      "title": "Canceled service after first visit",
      "text": "I scheduled a car wash with the fuel visit. “Rachel” confirmed the wash visit that morning via text message but they never showed up. When I asked about it, they said I cancelled it in the app...but I never did.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-01-03T08:06:52-07:00"
    },
    {
      "id": "3603788386",
      "userName": "Mrrr85",
      "userUrl": "https://itunes.apple.com/us/reviews/id177620758",
      "version": "v4.12",
      "score": 5,
      "title": "This is cool!",
      "text": "App works great.  I’ve never had a problem with it.  My wife loves that her car is filled up with gas while she is at work.  I also kept myself out of the doghouse by having Yoshi put on new wiper blades for my wife’s car which I had been forgetting to buy off Amazon for weeks! 😎",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2019-01-02T07:17:17-07:00"
    },
    {
      "id": "3596137042",
      "userName": "#appledaddy",
      "userUrl": "https://itunes.apple.com/us/reviews/id37334359",
      "version": "v4.12",
      "score": 5,
      "title": "So Sad",
      "text": "I love Yoshi. They show up at my office every Tuesday and fill up my truck. It’s so convenient and Prices are in line with local stations. \n\nHard to find an issue, so why am I sad? Christmas and Nee Years were both on Tuesdays this year and I had to pump my own gas two weeks in a row. Ugh! Going to a station, checking pump for skimmers, getting the auto fill to keep working, smelling like gas afterwards. \n\nYou may be asking why I didn’t just change my Yoshi day.  I forgot. The service always works without me thinking about it. \n\nI highly endorse Yoshi.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-12-31T07:59:40-07:00"
    },
    {
      "id": "3535054989",
      "userName": "John P Ward",
      "userUrl": "https://itunes.apple.com/us/reviews/id35427095",
      "version": "v4.12",
      "score": 4,
      "title": "Excellent service.",
      "text": "I’ve been using yoshi for over a year now. I love it. I’ve never had one issue.  Excellent customer service.  Adding my wife’s new car now.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-12-15T15:01:52-07:00"
    },
    {
      "id": "3500526830",
      "userName": "Tereshag1",
      "userUrl": "https://itunes.apple.com/us/reviews/id556677472",
      "version": "v4.12",
      "score": 5,
      "title": "Awesome Service!!",
      "text": "Their services are great and so easy to use!  I get my gas filled, car washed, and tires checked all while I’m at work!  Nothing like coming out of work and seeing your car sparkle and shine from across the parking lot and knowing that you don’t have to stop for gas during rush hour traffic!  And if you like in Silicon Valley, you know what I mean!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-12-06T08:11:45-07:00"
    },
    {
      "id": "3463198465",
      "userName": "Akinnetz",
      "userUrl": "https://itunes.apple.com/us/reviews/id682283610",
      "version": "v4.10",
      "score": 5,
      "title": "Best thing ever!",
      "text": "I have been using Yoshi for over a year now and it is the best decision ever made. I haven’t pumped gas (with my crazy schedule) in a year and I can’t explain how awesome it is! And GREAT staff!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-11-26T08:32:26-07:00"
    },
    {
      "id": "3364888609",
      "userName": "Justanothaguy",
      "userUrl": "https://itunes.apple.com/us/reviews/id240480244",
      "version": "v4.10",
      "score": 1,
      "title": "Bad service",
      "text": "I scheduled an appointment for service 2 days ago. Had confirmation for between 9 am-1 pm... 2 pm hits and no text about anyone in route so I contact customer service (which is only available via text by talking to people under the alias of a Rachel) and I get told that my order was cancelled. I never received an email or text telling me anything. I can’t place a new order because my app still believes my 1st order is still being processed. I ask can “Rachel” cancel my order within the app so I can make a new 1. Now all of a sudden I get an “error completing order” every time I attempt to schedule a new 1. It doesn’t matter what card details I use either. I text “Rachel” again asking if I’m being blocked from making a new appointment. Their reply was “Nope! So sorry!” ... I have $50 in credit and 4 days left of my free trial that’s about to expire and I haven’t gotten a lick of gas off this app yet",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-10-31T06:11:04-07:00"
    },
    {
      "id": "3350073711",
      "userName": "behheebdhcjje",
      "userUrl": "https://itunes.apple.com/us/reviews/id648532802",
      "version": "v4.10",
      "score": 2,
      "title": "Great concept but...",
      "text": "It’s being advertised in my area but not available. Kind of bummed, what a great idea! It would be nice to know if my location is available for services before I fully commit sending you my personal information.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-10-27T07:04:02-07:00"
    },
    {
      "id": "3346638638",
      "userName": "Jcwb&xmb",
      "userUrl": "https://itunes.apple.com/us/reviews/id105466055",
      "version": "v4.10",
      "score": 5,
      "title": "Fantastic!  Amazing!",
      "text": "I love this service and using the app is so easy and convenient. I recommend it to everyone.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-10-26T09:41:28-07:00"
    },
    {
      "id": "3319378240",
      "userName": "Mother of 2 waiting on #3",
      "userUrl": "https://itunes.apple.com/us/reviews/id604181875",
      "version": "v4.10",
      "score": 5,
      "title": "Great service",
      "text": "I have been using for a little over a month now and just love the service completely",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-10-19T06:13:23-07:00"
    },
    {
      "id": "3316367292",
      "userName": "Brevre794",
      "userUrl": "https://itunes.apple.com/us/reviews/id352229312",
      "version": "v4.10",
      "score": 1,
      "title": "If I could rate it a 0 I would.",
      "text": "The fact that I’ve been trying to schedule service for over a week and they never came. Rachel (customer service rep) was terrible, she doesn’t communicate with you if the drive is unable to make it to you or running behind and doesn’t nothing to solve the problem other than asking if you want to reschedule only to run into the same situation. How do you expect someone to pay for something and you guys aren’t completing the task!! Thennnn in order to cancel, you have to text her and tell her you want to cancel. What if she doesn’t do it?? You No control only she does. Ohh and my friend also had her card number ran w/o even having the service she requested!! GET IT TOGETHER!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-10-18T09:31:23-07:00"
    },
    {
      "id": "3315753279",
      "userName": "mosesallah",
      "userUrl": "https://itunes.apple.com/us/reviews/id552308485",
      "version": "v4.10",
      "score": 1,
      "title": "TRASH AS HELL",
      "text": "Throw the whole app away. It’s stupid, don’t tell someone they have a free credit of $20 and then when you are referred and signed up, you and the person “supposed” to get a $25 credit BULLSH** 🤣 save your time. I almost cursed everyone out dealing with this foolishness.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-10-18T06:02:53-07:00"
    },
    {
      "id": "3276157325",
      "userName": "axelx",
      "userUrl": "https://itunes.apple.com/us/reviews/id809735870",
      "version": "v4.9",
      "score": 1,
      "title": "Wow I can’t even get service",
      "text": "This app sound good but I can’t get service cause my location doesn’t have service 😒😒😒and my free mount service went to waste and they want me to pay before getting my free service had high hope",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-10-07T18:39:45-07:00"
    },
    {
      "id": "3263883854",
      "userName": "J.C.Wilk",
      "userUrl": "https://itunes.apple.com/us/reviews/id29703749",
      "version": "v4.9",
      "score": 5,
      "title": "Good for folks who live by busy gas stations",
      "text": "Customer service was exceedingly nice, and my cars were filled with gas without me being at home. The scheduling involved 5-10 texts.\n\nThis could be a great service for people whose gas stations are always busy.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-10-04T13:22:19-07:00"
    },
    {
      "id": "3257287408",
      "userName": "justindking",
      "userUrl": "https://itunes.apple.com/us/reviews/id630638231",
      "version": "v4.9",
      "score": 5,
      "title": "Helps me stay on track",
      "text": "Yoshi gas refills save me time. It also helps me keep up on routine things that I always lose track of, oil changes, and wiper blade swaps on keep my car going strong.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-10-02T18:54:44-07:00"
    },
    {
      "id": "3253040868",
      "userName": "J.Ontiveros",
      "userUrl": "https://itunes.apple.com/us/reviews/id248191164",
      "version": "v4.9",
      "score": 1,
      "title": "Very disappointed",
      "text": "They cancel my service same day. \nRachel couldn’t even call me , \nShe text me to let me know they couldn’t make it to my appointment. Probably won’t be using appt again...",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-10-01T14:41:40-07:00"
    },
    {
      "id": "3232960629",
      "userName": "RRD10",
      "userUrl": "https://itunes.apple.com/us/reviews/id911086013",
      "version": "v4.9",
      "score": 1,
      "title": "TOTAL SCAM",
      "text": "I only gave this company a one star because that was the only option!! I had a $50 free gas credit but once I put my card on file for whatever reason (being I had a free credit) I received a text message right before they was suppose to come out that my appointment was canceled, wow scam isn’t the word for this so called at your door service!! STAY AWAY PEOPLE IT’S LIES!! EVEN AT GAS STATIONS YOU DON’T HAVE TO DO THESE REQUESTS!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-09-26T10:21:40-07:00"
    },
    {
      "id": "3211032214",
      "userName": "StarskyandHutcheson",
      "userUrl": "https://itunes.apple.com/us/reviews/id441089485",
      "version": "v4.9",
      "score": 5,
      "title": "Upgrade your life!",
      "text": "This service has changed my life. I signed up for the novelty of the service, but soon it became something that I relied on heavily. I don’t even think about my fuel level anymore. Running out of petrol due to my busy schedule, or the late night service station pit stops after leaving the office are a thing of the past! Plus the app is clean and user friendly, and the customer service is second to none. This is a must for me, and I guarantee it will be for you.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-09-20T12:12:27-07:00"
    },
    {
      "id": "3210450304",
      "userName": "jadewey96",
      "userUrl": "https://itunes.apple.com/us/reviews/id683312397",
      "version": "v4.9",
      "score": 5,
      "title": "Amazing customer service",
      "text": "The app itself was a cool idea but it’s their customer service that really contributed to my five star rating. They assign you your own customer service rep that you can text or email with questions (mine was Rachel and she was super helpful). Thanks Rachel and Yoshi for helping me get a full tank of gas without lifting a finger!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-09-20T08:22:02-07:00"
    },
    {
      "id": "3164391663",
      "userName": "fatsantapro",
      "userUrl": "https://itunes.apple.com/us/reviews/id360859496",
      "version": "v4.8.1",
      "score": 5,
      "title": "Reliable and trustworthy",
      "text": "This app is great. The people who help fill your tank can be trusted to do the job quick and right. This app has saved me lots of time and there’s no more waiting in the long lines at Costco gas.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-09-07T10:24:18-07:00"
    },
    {
      "id": "3161056151",
      "userName": "Cassie3414",
      "userUrl": "https://itunes.apple.com/us/reviews/id901127959",
      "version": "v4.8.1",
      "score": 5,
      "title": "Love It",
      "text": "Amazing! Support team is super patient and the staff is friendly and helpful! I got my tank filled while at work easiest thing ever. Worth a download!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-09-06T14:20:47-07:00"
    },
    {
      "id": "3126419370",
      "userName": "fiveguys6787",
      "userUrl": "https://itunes.apple.com/us/reviews/id510890305",
      "version": "v4.8.1",
      "score": 1,
      "title": "Trash",
      "text": "Trash",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-08-28T16:10:31-07:00"
    },
    {
      "id": "3125869990",
      "userName": "eds2103",
      "userUrl": "https://itunes.apple.com/us/reviews/id7168795",
      "version": "v4.8.1",
      "score": 5,
      "title": "Super useful service, gorgeous app",
      "text": "Great gas prices, and great way to schedule regular car maintenance (oil change, car wash, etc). Wonderful service. So convenient. And a beautifully designed app! I love it!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-08-28T12:18:01-07:00"
    },
    {
      "id": "3122421365",
      "userName": "nickmcco",
      "userUrl": "https://itunes.apple.com/us/reviews/id780651248",
      "version": "v4.8.1",
      "score": 5,
      "title": "works and pretty great",
      "text": "i usually get gas with this app now. pretty convenient",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-08-27T16:28:10-07:00"
    },
    {
      "id": "3118534958",
      "userName": "Kate179",
      "userUrl": "https://itunes.apple.com/us/reviews/id6422068",
      "version": "v4.8.1",
      "score": 2,
      "title": "Can’t provide advertised services",
      "text": "Customer service kept telling me that services had been scheduled, then saying at the last minute they were unable to schedule the service and cancelling.  A great concept, but ultimately cost me more time than they saved me.  They should stick to fuel and not waste people’s time by pretending they can provide other listed services.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-08-26T18:20:15-07:00"
    },
    {
      "id": "3104156035",
      "userName": "ibilly89",
      "userUrl": "https://itunes.apple.com/us/reviews/id42661179",
      "version": "v4.8.1",
      "score": 1,
      "title": "$20 a month fee!",
      "text": "What they forget to tell you before you enter your credit card number is there is a $20 a month fee.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-08-23T07:48:19-07:00"
    },
    {
      "id": "3092545413",
      "userName": "DLusty",
      "userUrl": "https://itunes.apple.com/us/reviews/id109991615",
      "version": "v4.8.1",
      "score": 1,
      "title": "Rip-off",
      "text": "So before you get started let me lay down some basic math for you. First off you have to pay a membership fee of $20 a month (which they give a free month when you sign up). The membership fee comes out to be about $0.65 a day(for a full year). The gas you can chose from is regular or premium unleaded. I chose regular which was $2.68 at the time. The current price of regular unleaded in my area is around $2.40, mid grade $2.64, and premium is $2.89. You only “save money” on gas when you order extra services. They didn’t list the price of the services but showed how much you would save on gas. At the end of the day you are paying roughly $0.65 a day for a membership, then you add up the price of gas plus any extra services. Now with the extra services you add you will save money on gas alone, but you need to add up how many days you go with out filling up. I.E. you go 5 days without filling up $0.65*5=$3.25 plus add on the gas $2.68*gallons, then add the extra services then minus the discount they give you. I believe the highest discount I saw was $1.00 for an oil change. To me this is a complete rip off. You’re not going to save any money and in reality you are going to spend a lot more money. I just hate when companies say their users “save” X amount of money, when they actually end up spending more money. I understand it’s a delivery system which I expected the gas prices to be a little higher but I did not expect a membership fee, and when you add that membership fee into the price of the gas it’s outrageously expensive. Maybe if they got rid of the membership fee or lowered it, it would be worth it.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-08-20T16:21:52-07:00"
    },
    {
      "id": "3006245736",
      "userName": "tgoodie2018",
      "userUrl": "https://itunes.apple.com/us/reviews/id472759579",
      "version": "4.0",
      "score": 1,
      "title": "No gas for me",
      "text": "Set up gas delivery for 9-1p today they asked for credit card . I provided it even though I have a $50 credit . Then I got a text saying My service was canceled because my card was declined . I don’t understand why my card is being charged prior to service . So I inquired with the infamous Rachel she said they have a pre authorized charge to make sure your able to pay the remaining balance of the service . I have a tiny itty bitty car even with premium gas it’s only 20/25 to fill up not to mention I’m not on E! But I’ll digress . So I ask her how much is the charge and still no response . I only give it 1star because I like the idea of it but it needs to work and needs to be better explained . Waste of time . Also I’m scheduled for delivery next week which I didn’t ask for nor do I need . I can’t delete my credit card I keep receiving error message . Since Rachel is all of a sudden so busy I would love for someone to make it so that I can delete my credit card info . I don’t want to be charged for services I never received .",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-08-02T06:43:17-07:00"
    },
    {
      "id": "2886317777",
      "userName": "vpham022012",
      "userUrl": "https://itunes.apple.com/us/reviews/id733850812",
      "version": "4.0",
      "score": 1,
      "title": "Useless App",
      "text": "I see the ads on Facebook and download the app. I open the account and found out that my address is not service yet. If you could not service don’t make people wasting time to open the account with you simply check the location if you can service them then let people open account.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-07-11T10:32:36-07:00"
    },
    {
      "id": "2689673591",
      "userName": "Alienesque",
      "userUrl": "https://itunes.apple.com/us/reviews/id146396091",
      "version": "4.0",
      "score": 1,
      "title": "Doesn't work with OnStar.",
      "text": "I linked my OnStar account to the app and now it just completely freezes up. I've tried closing the app and reopening AND deleting and re-downloading. I'd love to explore the features on the app but unfortunately it does not work.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-06-13T15:54:11-07:00"
    },
    {
      "id": "2652345575",
      "userName": "Agbomg",
      "userUrl": "https://itunes.apple.com/us/reviews/id37750162",
      "version": "4.0",
      "score": 1,
      "title": "App constantly crashes",
      "text": "Might be great service. I’ll never know because the app crashes constantly and consistently. The whole thing strikes me as half-baked and poorly implemented. Sorry to disagree with the enthusiastic paid reviewers but don’t waste your time.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-06-06T14:42:08-07:00"
    },
    {
      "id": "2652061753",
      "userName": "Nanani1013",
      "userUrl": "https://itunes.apple.com/us/reviews/id642368474",
      "version": "4.0",
      "score": 1,
      "title": "registered for nothing",
      "text": "App should allow users to verify if their area is serviced BEFORE we have to REGISTER!!! \nOnce you download is asks for your phone #, name, car info & address without even letting you check if it will work.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-06-06T13:04:19-07:00"
    },
    {
      "id": "2616884023",
      "userName": "samark22",
      "userUrl": "https://itunes.apple.com/us/reviews/id155787860",
      "version": "4.0",
      "score": 5,
      "title": "Top Rate Customer Service",
      "text": "Outstanding proactive customer service approach which makes the entire process even easier.  Happy to see Yoshi associated with premium fuel brands, Exxon and Mobil.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-05-30T05:41:38-07:00"
    },
    {
      "id": "2608076897",
      "userName": "Adfgleyiombv",
      "userUrl": "https://itunes.apple.com/us/reviews/id103931584",
      "version": "4.0",
      "score": 1,
      "title": "Doesn't work",
      "text": "Trying to repeatedly register.  Unsuccessful. Bet they're wondering why people aren't using their service!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-05-28T07:08:38-07:00"
    },
    {
      "id": "2590158383",
      "userName": "ClevelandsTJ",
      "userUrl": "https://itunes.apple.com/us/reviews/id810044657",
      "version": "4.0",
      "score": 1,
      "title": "Customer service",
      "text": "The representative for Cleveland Rachel refused to use my $30 credit to fill my tank and my friend had the same problem and it’s fees undisclosed. I would not recommend",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-05-24T07:44:12-07:00"
    },
    {
      "id": "2492804604",
      "userName": "Stylechik",
      "userUrl": "https://itunes.apple.com/us/reviews/id172289030",
      "version": "4.0",
      "score": 5,
      "title": "Great experience but would like to see my use history",
      "text": "I used Yoshi for the 1st time yesterday in the Tampa market!  Service was excellent, on time and quick.  I requested to fill my car at work through the app, a timeframe for delivery was provided to me and no problems. One product update I’d like to see is usage history... in real-time. It would be nice to track.  Other than that, I loved it!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-05-01T10:37:27-07:00"
    },
    {
      "id": "2491789181",
      "userName": "whits82",
      "userUrl": "https://itunes.apple.com/us/reviews/id40065629",
      "version": "4.0",
      "score": 3,
      "title": "Buggy app but great service",
      "text": "First of all, I LOVE Yoshi and will never go back to actually pumping my own gas! I have used it a couple times for oil changes too, which is so convenient and no more expensive than other oil changes. I tell so many people about Yoshi. It’s great. My only frustration is with the app. I have had several occasions where I change the location of my car for gas day or change the day I want my service, and the app defaults back to my usual settings. They get around this by sending me confirming text messages and asking me to drop a pin to confirm my order, but it would be really nice if the app were just a little smarter and the design more intuitive.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-05-01T05:17:25-07:00"
    },
    {
      "id": "2298880593",
      "userName": "Vinnyjr.com",
      "userUrl": "https://itunes.apple.com/us/reviews/id103343397",
      "version": "3.4",
      "score": 5,
      "title": "The Future",
      "text": "Nice experience so far. Rachel is very helpful. Not sure if I can justify the extra $20 a month, but I love the concept knowing a full tank is but a click away.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-03-12T10:19:37-07:00"
    },
    {
      "id": "2293508194",
      "userName": "Skatebord imam",
      "userUrl": "https://itunes.apple.com/us/reviews/id35368072",
      "version": "3.4",
      "score": 1,
      "title": "Epic Fail",
      "text": "Used this app to take advantage of the service. I was low on fuel and low on time rushing to get to a flight. I also knew I would be coming home a day later at midnight and would not be excited to stop for gas after a long flight. Ordered gas one day ahead, followed all the instructions, including setting a pin and was all set. \n\nThe day after Yoshi was to deliver gas, I had no confirmation. I reached out to “Rachel” via text and was told my ordered had been cancelled via the app. Wasn’t on my end. \n\nEpic Fail!!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-03-10T22:18:08-07:00"
    },
    {
      "id": "2180656585",
      "userName": "Warren Zoholic",
      "userUrl": "https://itunes.apple.com/us/reviews/id166634254",
      "version": "3.4",
      "score": 5,
      "title": "“There’s an app for that” :D",
      "text": "Getting gas is dumb. Having gas delivered is so much better. The customer service with Yoshi has been so easy. Having a text based customer service experience is super clutch compared to everyone else. Thank you Yoshi for saving me hours and hours of life by not having to go to a gas station!!!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-02-07T20:42:16-07:00"
    },
    {
      "id": "2142420260",
      "userName": "Rawchell",
      "userUrl": "https://itunes.apple.com/us/reviews/id105411463",
      "version": "3.4",
      "score": 1,
      "title": "Can’t use it",
      "text": "Won’t let me put in my vehicle to order gas so... thanks anyway",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-01-29T10:53:48-07:00"
    },
    {
      "id": "2122961718",
      "userName": "On thr go father of 3",
      "userUrl": "https://itunes.apple.com/us/reviews/id137248686",
      "version": "3.4",
      "score": 5,
      "title": "Look forward to scheduling oil changes and washes.",
      "text": "Everyone can make time to go to a gas station, but who the heck wants to go. Bad things happen there. At the gas station I get my hands dirty, buy junk food I don’t need, stand around, and waste time. With Yoshi, I have an extra 20 minutes each week to do things I actually want to do. Can’t wait to get my car wash and oil change next week. Finally, the cherry on top is the service. Being easily reachable, friendly, and understandable goes a long way in my book.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2018-01-24T13:46:00-07:00"
    },
    {
      "id": "1815636580",
      "userName": "Ernst19883",
      "userUrl": "https://itunes.apple.com/us/reviews/id85122604",
      "version": "3.0.1",
      "score": 5,
      "title": "Amazing customer service!",
      "text": "Last week my wife took my truck to work. Neither one of us realized that it was low on fuel and she was going to be working super late and most gas stations are closed by a certain time. I downloaded the app trying to figure out something for my wife. Within a few minutes I got a text from Rachel saying that if I had any questions or needed anything, she would be glad to help. I explained my situation and she immediately reached out to one of her drivers in the area to see if it was a possibility. I was concerned about her being parked in a restricted garage, that they would not be able to get to it. Initially they said they didn’t think it would work and we could have ended the conversation there and I would have been extremely pleased with the customer service provided because they tried to help in such short notice. But Rachel text me a few moments later and said if someone could give them access, it would be no problem and they made it happen same night. I could not be happier with this service. Highly recommend.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2017-09-28T15:50:23-07:00"
    },
    {
      "id": "1749974708",
      "userName": "GskKing",
      "userUrl": "https://itunes.apple.com/us/reviews/id148720375",
      "version": "3.0.1",
      "score": 1,
      "title": "Could not even create account",
      "text": "App does not warkwork",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2017-08-25T21:07:36-07:00"
    },
    {
      "id": "1736415786",
      "userName": "Pepsicola1990",
      "userUrl": "https://itunes.apple.com/us/reviews/id101183308",
      "version": "3.0.1",
      "score": 1,
      "title": "DO NOT DOWNLOAD OR REGISTER",
      "text": "Genuine review. Do not download or subscribe! Company hides vital information behind a credit card paywall and uses sketchy tactics. \n\nPlease please listen to this review and don't download this app!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2017-08-20T18:14:47-07:00"
    },
    {
      "id": "1715690216",
      "userName": "chadequate",
      "userUrl": "https://itunes.apple.com/us/reviews/id13913495",
      "version": "3.0.1",
      "score": 1,
      "title": "Internal Server Error",
      "text": "I've tried multiple times over the coarse of several days and I'm unable to create an account.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2017-08-06T06:11:09-07:00"
    },
    {
      "id": "1697985300",
      "userName": "Nick Russell 837",
      "userUrl": "https://itunes.apple.com/us/reviews/id390333959",
      "version": "3.0",
      "score": 1,
      "title": "Can not sign up. Internal error 500. Do not publish without testing.",
      "text": "Debug soon.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2017-07-25T11:55:55-07:00"
    },
    {
      "id": "1666260648",
      "userName": "Seah873",
      "userUrl": "https://itunes.apple.com/us/reviews/id49644487",
      "version": "3.0",
      "score": 5,
      "title": "Love this service!!!",
      "text": "Yoshi is amazing. I haven't had to stop at a gas station in 9 months, which is awesome as I hate getting gas. I always used to run out at the worst times...when I was late for a meeting, or at night (as a female I never felt safe stopping at a station at night). Now I don't have to give it a moments thought. My car always has gas. And I don't have to lift a finger or even be present when they fill me up. Such a great service! And everyone I've dealt with at Yoshi is extremely helpful and professional. I can't recommend it enough!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2017-07-02T08:29:20-07:00"
    },
    {
      "id": "1584977788",
      "userName": "Dana Dunford",
      "userUrl": "https://itunes.apple.com/us/reviews/id165132137",
      "version": "2.3.0",
      "score": 5,
      "title": "Hands down best service",
      "text": "Can't say enough good things about them!!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2017-04-09T16:49:17-07:00"
    },
    {
      "id": "1569456382",
      "userName": "Murphy4501",
      "userUrl": "https://itunes.apple.com/us/reviews/id32181572",
      "version": "2.3.0",
      "score": 5,
      "title": "Life Changing!!",
      "text": "Yoshi is the best! I definitely do NOT miss stopping at the gas station to fill-up!! \n\nThe App is easy to use and the customer service is 🙌🏻!! This service is a game changer!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2017-03-21T09:02:35-07:00"
    },
    {
      "id": "1563766377",
      "userName": "TheRealJwoOzy",
      "userUrl": "https://itunes.apple.com/us/reviews/id165909434",
      "version": "2.3.0",
      "score": 5,
      "title": "Yoshi, I love it!",
      "text": "It's simple and makes my life easier. App's really clean, the service is really smooth. They come every Tuesday to fill up my car and clean my windows and I leave with a full tank. \nI've been using it for a couple months now, and will keep using it.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2017-03-13T11:06:11-07:00"
    },
    {
      "id": "1551259868",
      "userName": "Gumpyyy",
      "userUrl": "https://itunes.apple.com/us/reviews/id267799714",
      "version": "2.2.9",
      "score": 5,
      "title": "Convenient and surprisingly affordable service",
      "text": "Just gave the service a try, paid a very respectable and competitive price for fuel. The added convenience is definitely worth the added convenience.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2017-02-23T21:57:07-07:00"
    },
    {
      "id": "1456999066",
      "userName": "KUTODD",
      "userUrl": "https://itunes.apple.com/us/reviews/id526935773",
      "version": "2.2.8",
      "score": 5,
      "title": "Great first experience.",
      "text": "Great communication throughout the entire process.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2016-09-27T19:04:48-07:00"
    },
    {
      "id": "1456350400",
      "userName": "Monda customer",
      "userUrl": "https://itunes.apple.com/us/reviews/id526724656",
      "version": "2.2.8",
      "score": 1,
      "title": "Rude customer service",
      "text": "Good idea and is probably a great service but the customer service side of things is rude and not very informed on the service times the person i spoke with was Rachel I tried to set up gas for a delivery on Monday I received a text from Rachel and was told I could get gas Monday and just needed to add my credit card by noon which I did but some how my delivery was canceled.. contacted Rachel about the situation and she was rude about the situation and that basically tired to make it my fault and said I needed to have my card entered by 9am which is not what she told me so I'm left with no gas which is the whole point of the service.. just sharing my experience",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2016-09-26T12:57:57-07:00"
    },
    {
      "id": "1456233700",
      "userName": "Baldrjh",
      "userUrl": "https://itunes.apple.com/us/reviews/id460598448",
      "version": "2.2.8",
      "score": 5,
      "title": "This service is fabulous!",
      "text": "I was doubtful at first this could be worth it but boy was I wrong.  I arrive at work on fumes and leave with a full tank and a receipt on my cell phone.  They even check my tire pressure.  Their CS is top notch and easily accessible.  Between texting and email they get back to you quickly. I HIGHLY recommend!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2016-09-26T07:23:53-07:00"
    },
    {
      "id": "1442955965",
      "userName": "BooPaws",
      "userUrl": "https://itunes.apple.com/us/reviews/id197746950",
      "version": "2.2.7",
      "score": 5,
      "title": "Free tank? Impressed",
      "text": "I was really impressed by the convenience. I got a free tank of gas for using it for the first time with the code alexs1763. Good customer service too.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2016-09-01T12:59:09-07:00"
    },
    {
      "id": "1417000866",
      "userName": "droopycom1",
      "userUrl": "https://itunes.apple.com/us/reviews/id149499161",
      "version": "2.2.7",
      "score": 2,
      "title": "Unintuitive",
      "text": "Found this app in my Facebook feed. \nJust went through Setup. First question: \"what's your number?\"  I guess they meant my phone number, but could you be more explicit? And why do they need it? No explanation... Then asked address. Couldn't use my current location although it asked for authorization. The setup screens looks weird too, using non standard widget. Off putting to me.  Looks amateurish.\n\nThen the service: only do a weekly or twice a week, I don't need that much. Also my work parking lot is big and gets busy, so how will they figure out where my car is? Are they going to need me to come down and show them? \nPrice: no mention of delivery or service fee. If there is none they should advertise that because that's the only major problem I have with the concept. Other similar service (with better app) do charge $3, which is about 8% for a fillup. With weekly partial fills, that would raise the cost of there is a fee. \n\nThey need to explain there service much better and hire a designer for their app.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2016-07-21T14:55:31-07:00"
    },
    {
      "id": "1216876092",
      "userName": "Smith-Bentley",
      "userUrl": "https://itunes.apple.com/us/reviews/id27797619",
      "version": "1.1.0",
      "score": 5,
      "title": "It worked!",
      "text": "Amazing. Gas tank filled while I was at work. Seems like it's too good to be true - except it's not! #Stanford",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2015-06-23T17:59:56-07:00"
    },
    {
      "id": "1213985128",
      "userName": "raager",
      "userUrl": "https://itunes.apple.com/us/reviews/id24807029",
      "version": "1.1.0",
      "score": 5,
      "title": "Simple, awesome, cost-effective",
      "text": "Yoshi's fantastic. Super convenient to have them fill up gas while your car is parked—and at the same price you'd pay at a gas station.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2015-06-17T22:02:13-07:00"
    },
    {
      "id": "1213970182",
      "userName": "Freeing up time",
      "userUrl": "https://itunes.apple.com/us/reviews/id16786214",
      "version": "1.1.0",
      "score": 5,
      "title": "Great time saver, well worth it",
      "text": "I arrived home only to realize I was on E and had an early meeting in the morning. Yoshi filled up my tank hassle free and I was topped off and ready to go by the morning.  I'll definitely use this amazing service again.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2015-06-17T21:13:26-07:00"
    },
    {
      "id": "1212879143",
      "userName": "Crisscross81",
      "userUrl": "https://itunes.apple.com/us/reviews/id81018143",
      "version": "1.1.0",
      "score": 5,
      "title": "Makes me want to live in the valley",
      "text": "So convenient! Incredible it's taken so long for someone to come up with a service like this. 10/10. Very well done. Amazing service. Friendly team! Recommend.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2015-06-15T13:41:04-07:00"
    },
    {
      "id": "1212559108",
      "userName": "gsaba24",
      "userUrl": "https://itunes.apple.com/us/reviews/id29187970",
      "version": "1.1.0",
      "score": 5,
      "title": "A Game Changer",
      "text": "I will never go to a gas station again. Instead, I will use yoshi. There is NO service charge, you don’t have to be there during fill up and its the same price of gas at the local station. Why would anyone ever go to a gas station again?! I’ve had two fill ups and they have gone very smoothly. Save gas and time that is usually wasted by using yoshi.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2015-06-14T22:10:55-07:00"
    },
    {
      "id": "1212330667",
      "userName": "Murphy MacManus #LH",
      "userUrl": "https://itunes.apple.com/us/reviews/id457123632",
      "version": "1.1.0",
      "score": 5,
      "title": "Tim Ferris would be proud",
      "text": "Eliminating one more task from the daily grind enables me to focus on what's relevant (my business, friends and family) and eliminate time sinks.\n\nService and delivery as promised. I even got a friendly notification about my tire pressure (front right was 5 psi below the rest). \n\nFresh app and even cooler truck!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2015-06-14T10:13:05-07:00"
    },
    {
      "id": "1212074361",
      "userName": "KMVpittsuper⭐️",
      "userUrl": "https://itunes.apple.com/us/reviews/id457108576",
      "version": "1.1.0",
      "score": 5,
      "title": "Life saver",
      "text": "I'm a commuter and I have to fill my tank up twice a week. After a long day, that used to be the last thing I wanted to do. Since I started using the Yoshi service I don't think about getting gas at all anymore :) luv it!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2015-06-13T23:34:14-07:00"
    },
    {
      "id": "1211791910",
      "userName": "Weiro268",
      "userUrl": "https://itunes.apple.com/us/reviews/id173194957",
      "version": "1.1.0",
      "score": 5,
      "title": "Such a time saver",
      "text": "My tank was on low, but I hadn't had a chance to refill due to my busy lifestyle. Plus, the gas stations near my house close at 10pm, which is when I usually have time.\n\nI ordered gas from Yoshi while I was at work, and my tank was full by the time I got out! App is easy to use and they send you text messages to let you know when they've filled you up.\n\nBest thing is that they deliver from 12am-5am, when gas stations tend to be closed (or maybe unsafe). The next morning you don't have to worry about getting gas and can just be on your way!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2015-06-13T09:50:36-07:00"
    },
    {
      "id": "1211418081",
      "userName": "ekfuller",
      "userUrl": "https://itunes.apple.com/us/reviews/id33964642",
      "version": "1.1.0",
      "score": 5,
      "title": "So convenient!",
      "text": "When I see my tank low on my way to work I can have it filled while there instead of having to stop on my way home. And the price is about the same as it would be at the station.",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2015-06-12T18:07:42-07:00"
    },
    {
      "id": "1211317936",
      "userName": "Ag204204",
      "userUrl": "https://itunes.apple.com/us/reviews/id47696409",
      "version": "1.1.0",
      "score": 5,
      "title": "Really amazing app",
      "text": "This was the most convenient tank of gas I've ever purchased. I never need to go to a gas station again!",
      "url": "https://itunes.apple.com/us/review?id=992735679&type=Purple%20Software",
      "updated": "2015-06-12T12:54:45-07:00"
    }
  ]
}